{"_id":"5efef5d38b113b0bd047edc6","_type": "recipe", "ingredients":["3 large eggs","65 mL (4 Tbsp + 1 tsp) soy sauce, divided","24 g (6 tsp) tsp sugar, divided","1/8 tsp salt","1 carrot, cut into matchsticks","1 red bell pepper, cut into matchsticks","2 green onion, sliced on the bias","20 g (1/4 cup) coconut flakes","100 g (3/4 cup) peanuts, lightly toasted and coarsely chopped","400 g (14 oz) somen or udon noodles","25 mL (5 tsp) sesame oil, divided","10 mL (2 tsp) fish sauce","Juice of 1 lime","10 mL (2 tsp) neutral oil","Fresh basil leaves for garnish"],"steps":["Put a large saucepot of salted water on the stove to boil.","Meanwhile, whisk eggs, 1 tsp soy sauce, 2 tsp water, 2 tsp sugar, and salt together in a small bowl.","Heat a medium non-stick skillet over medium-high heat. When hot, add 1 tsp of oil to the pan. Pour in enough egg mixture so that the bottom of the pan is coated.","When the egg is cooked through, roll it up in the pan with the help of a spatula or chopsticks as if you were rolling up a rug. Leave the rolled egg at one end of the pan.","Pour another layer of egg into the pan. Once cooked through, begin with the previously rolled egg and roll it into the newly cooked egg. Your egg roll will now be larger. Repeat this process until all the egg has been cooked. Remove the rolled egg from the pan and allow to cool.","Add the noodles to the boiling water and cook following the noodles' package instructions. Once cooked, empty noodles into a colander and rinse with cold water.","Put the noodles in a medium bowl and toss with 1 tsp of sesame oil.","Slice the rolled up egg into 6mm (1/4 in) rounds.","To make the sauce, mix together in a small bowl or jar the fish sauce, lime juice, 4 Tbsp soy sauce, 4 tsp sugar, and 4 tsp sesame oil until the sugar is dissolved.","To assemble the dish, divide the noodles into four shallow bowls. Top with egg rounds, carrots, bell pepper, peanuts, and coconut flakes. Pour the sauce, and garnish with basil leaves."],"images":["https://i.ibb.co/L8qwYF7/noodle-bowl.jpg"],"is_published":true,"publish_date":"2020-07-20T06:57:49.22Z","created":"2020-10-27T01:12:19.302Z","title":"Cold Noodle Bowl with Tamagoyaki","duration":45,"intro":"My best friend introduced me to Tamagoyaki. Never before had I added sugar to a stove-top egg dish. Some of you in the know are going to read through the ingredients and demand to know why you don’t see the word “dashi.” You make a good point. This is my pseudo version of Tamagoyaki. Maybe I should be calling it a rolled egg omelette, but Tamagoyaki is an awesome word. And while I realize this makes me sound ignorant about the Japanese language, the word makes me think of Tamagotchi, which makes me think about the digital pets of my 90s childhood.\n\nAnyway, time for some notes on this refreshing dish. When it comes to noodles, I typically choose somen. They seem to really absorb the sauce, and the way they swirl into the bowl is just graceful. If I don’t use somen, I use soba. Feel free to experiment with other types of noodles, maybe I will too. Regarding cooking the noodles, I suggest waiting until you are practically ready to assemble the dish before boiling them. If you cook them first and then let them sit while you prepare everything else, the noodles will most likely end up sticky and clump together.\n\nThe sauce is extremely forgiving and is designed to give you creative freedom. While I generally use regular soy sauce, I’ve used black soy sauce as a substitute on several occasions, but combined with the sugary eggs it can be a bit too sweet.\n\nMy main recommendation (and plea) for this dish is that you cut the vegetables into matchsticks. Why? They look good. They look really good. Small piles of diced carrot and cucumber on top of the noodles just don’t make you do a double take the same way neatly aligned stacks of julienned vegetables do. Also, this is the perfect opportunity to improve those knife skills, amirite? \n\nNow the egg. This is by far the most difficult step in the process. I’ll start with a side note. Maybe this is common knowledge, but are you aware that each pleat of a chef’s hat represents a different way to cook an egg? So learn the Tamagoyaki and that’s one more pleat for you. \n\nHere’s what works for me. First, the pan needs to be hot. Don’t pour the first layer immediately after you turn the heat on. Wait until the pan is actually hot, add some oil, give the oil a moment to heat up, and &amp;amp;amp;amp;amp;lt;em&amp;amp;amp;amp;amp;gt;then&amp;amp;amp;amp;amp;lt;&amp;amp;amp;amp;amp;#x2F;em&amp;amp;amp;amp;amp;gt; add the first egg layer. I used to roll up the cooked layer with the help of a spatula (and my fingers), but recently I read somewhere that using two chopsticks makes the whole process go much smoother. It’s true, I’m telling you.\n\nAnother egg secret. Be sure to keep the pan oiled. If your non-stick isn’t as non-stick as it claims to be, this whole egg thing will go downhill if you forget the oil between pours. Speaking of the layers, I keep mine relatively thin. I find it makes the rolling easier and results in fewer breaks and tears as the egg rolls and bends.","quote":"This is your chance to julienne some vegetables.","size":"4","description":"Make a bed of cold noodles tossed in sesame oil, top with beautiful vegetable matchsticks and slices of rolled egg omelette (Tamagoyaki sans dashi), and serve with a strong sauce you can shake together in an empty jar. Not much else to it.","keywords":"cold noodles, julienne, relatively quick","prep_time":10,"cook_time":15,"category":"Lunch, Dinner","cook_method":"Boil, Fry","cuisine":"Asian","ratings":[5],"__v":0,"newsletter":false}
{"_id":"5efef5d38b113b0bd047edc8","_type": "recipe", "ingredients":["28 g (2 Tbsp butter)","25 ml (1 Tbsp + 2 tsp) olive oil, divided","1 medium onion, diced","2 medium garlic cloves, minced","1 tsp dried coriander","1/2 tsp nutmeg, freshly grated","1 carrot, coarsely chopped","1 small kohlrabi or turnip, peeled and coarsely chopped","700 g (1.5 lb) celery root, peeled and chopped into 2.5 cm (1 in) cubes","720 mL (3 cups) chicken stock","240 mL (1 cup) water","3/4 tsp salt, divided","black pepper","parsley for garnish"],"steps":["Heat butter and olive oil in a large saucepot over high heat.","Add onion and 1/4 tsp salt. Cook for 3-5 minutes, stirring frequently.","Add garlic, coriander, and nutmeg and stir for 30 seconds.","Reduce heat to medium. Add carrot, kohlrabi/turnip, and celery root. Cover the pot and cook for 20 minutes. Stir occasionally.","Add chicken stock, water, and 1/4 tsp salt, increase heat to high, and bring to a boil.","Reduce heat, cover, and simmer for 20 minutes. Stir occasionally.","Remove from heat and use an immersion blender (or carefully a stand blender if you prefer) and blend until smooth. Add 1/4 tsp salt and black pepper to taste.","Garnish with freshly ground black pepper and sprigs of parsley."],"images":["https://i.ibb.co/dBTF9Nr/celery-soup.jpg"],"is_published":true,"publish_date":"2020-07-25T06:54:15.913Z","created":"2020-10-27T01:12:19.302Z","title":"Celery Root Soup","duration":70,"intro":"This is a guide on how to turn that brown, knobbly bowling ball you picked up from the bottom shelf of the produce section into a delectable, non-knobbly, even very creamy, soup. The great thing about celery root (also known as celeriac, or my favorite, knob celery) is that you don’t have to cook it immediately. It has a relatively long shelf life. So no rush, man. Let the knob hang around for a while. When you are ready, come back to this page.\n\nYou’ll notice kohlrabi is on the list of ingredients. When I was developing this soup I had a small kohlrabi in the vegetable drawer of my fridge. Occasionally when I am perusing the produce section I will buy fruits and vegetables that I couldn’t put a name to if my life depended on it. At home I do my research and have fun experimenting with a new flavor. This is how I learned what a kohlrabi is and how it ended up in this soup. If you can’t find one or don’t want to try something new, just use a turnip. Turnips are way more common anyway.\n\nThe entire process is fairly straightforward. You most importantly need to make sure you cook the celery root and kohlrabi&amp;amp;amp;#x2F;turnip until they are knife-tender. Be patient and it will soon be time to blend it all together.\n\nSince I started using an immersion blender a couple years ago, my soup-making motivation has soared. Remember that next time you’re staring at an immersion blender on a store shelf and wondering if you would ever use it. Definitely worth the $30.  \n\nWhen you are serving the soup, be sure to throw in a few extra grinds when adding the black pepper. The butter, nutmeg, pepper combo pairs incredibly with the root flavors. Enjoy.","quote":"Intense root flavors in a creamy soup.","size":"3 - 4","description":"Sometimes you look at celery root and you might swear you are looking right at one of the monsters from Jim Henson’s Labyrinth (googleimage “celery root” and then googleimage “labyrinth monsters”). The truth is, celery root makes a mean soup. Add just the right spices and you win every time.","keywords":"Hot soup, roots, nutmeg, turnip, celery","prep_time":15,"cook_time":50,"category":"Dinner","cook_method":"Fry, boil, blend","cuisine":"American","ratings":[],"__v":0,"newsletter":false}
{"_id":"5efef5d38b113b0bd047edc7","_type": "recipe", "ingredients":["*CREPES","2 large eggs","240 mL (1 cup) milk","30 g (2 Tbsp) plain yogurt","120 g (1 cup) all-purpose flour","1/4 tsp salt","14 g (1 Tbsp) butter, melted","Additional butter for cooking","*FILLING","Brown mustard","Green-leaf lettuce","4 slices deli chicken meat","4 fried eggs, runny yolk","55 g (2 oz) blue cheese","2 Tbsp finely chopped parsley","1 green onion, chopped","Black pepper"],"steps":["*CREPES","In a medium bowl, beat together 2 eggs, the milk, and the yogurt until combined.","Add the flour and salt and use a fork or an immersion blender to mix batter until smooth.","Stir in the melted butter.","If time permits, allow the batter to rest for about 30 minutes. This is not mandatory.","Heat a non-stick medium skillet over medium-high heat and add a pat of butter to the pan.","Pour around 80 g (1/3 cup) of the batter into the pan and immediately swirl the pan to evenly coat the bottom.","Once the edges appear cooked (after about 1 minute), flip the crepe and cook for another 2 minutes until done.","Transfer crepe to a clean plate and repeat with remaining batter, adding butter to the pan as needed. The batter should yield about eight crepes.","*ASSEMBLY","To assemble, spread about 1 tsp of mustard in a line down the middle of a crepe. Then layer lettuce, chicken, a fried egg, and a spoonful of blue cheese on top of mustard.","Wrap up the sides of the crepe and top with green onion, parsley, and black pepper."],"images":["https://i.ibb.co/1zGyQfB/savory-crepe1.jpg","https://i.ibb.co/ZdwMBRr/savory-crepe2.jpg","https://i.ibb.co/mD7fz1N/savory-crepe3.jpg"],"is_published":true,"publish_date":"2020-07-30T05:03:16.289Z","created":"2020-10-27T01:12:19.302Z","title":"Savory Crepes","duration":45,"intro":"Do you want guaranteed money for you and your family for the next 365 days? Keep reading! This upcoming February 2nd, make a crepe in a frying pan (sure, you can use my recipe, why not) and place a gold coin in your non-flipping hand (I’ll send the first person who reads this and contacts me a complimentary gold coin). Now, grab the pan handle, keep that gold coin in your other hand, and flip the crepe. If you pull off a clean flip, that’s money for you and your family for one year. If not, get rid of that coin because you lose, sorry. Some solid superstition straight from France.\n\nNow, what to do with your money-making crepe? I’ll tell you. Fill it with just the right combination of flavors and turn it into your next meal. Here I present you with my selection of ingredients and steps for my favorite savory crepes. \n\nDon’t overcook the crepes, or they will start to resemble large wafers and will crack and crumble as they are rolled. Just make sure you preheat the pan long enough and keep it at a relatively high temperature. The batter will cook through while leaving you with those nice brown spots we all like to see on our crepes. And remember to add a pat of butter to the pan between crepes. \n\nAnother suggestion (requirement) for this meal is to leave the yolks of your fried eggs runny. The yolk essentially acts as the sauce for the meal. The last thing you want to do is cut into your crepe and find a dry, crumbly yolk. \n\nThe amount of mustard you spread is up to you. I usually do about 1 tsp, but it all depends on how strong the mustard is. You don’t want mustard overkill, but the flavor should definitely be present. \n\nOne last thing. I don’t mention it in the instructions (you’re getting the inside scoop, yo), but once I’ve assembled the crepe, I usually gently place it back in the pan and cook it for about one minute per side before serving on a plate and topping with the green onion, parsley, and pepper.\nIt’s not necessary, but it gives the crepe a nice toast and raises the temperature a degree or two before serving.","quote":"When blue cheese steps in for Nutella.","size":"3 - 4","description":"It’s hard to beat a sweet, hot crepe full of Nutella, but stuff a crepe with strong mustard, blue cheese, and an egg and you’ll have some fierce competition.","keywords":"savory, crepe, mustard, blue cheese","prep_time":40,"cook_time":40,"category":"Dinner","cook_method":"Fry","cuisine":"French","ratings":[5],"__v":0,"newsletter":false}
{"_id":"5efef5d38b113b0bd047edc9","_type": "recipe", "ingredients":["500 g (1 lb) Yukon Gold potatoes","1 large yellow onion","1/2 tsp salt, divided","60 mL (1/4 cup) vegetable oil","1 large garlic clove","6 eggs","2 Tbsp minced fresh parsley","1/4 tsp black pepper"],"steps":["Peel the potatoes and slice into 5 mm (1/4 inch) rounds.","Peel and dice the onion.","Chop the parsley.","Crush and mince the garlic with either a knife or a garlic press.","Heat a medium (~23cm / 9in) non-stick skillet over medium heat. Add the oil once the pan is hot.","Add the onion to the pan and cook for 2-3 minutes.","Add the potatoes and 1/4 tsp salt and reduce the heat to medium-low.","Frequently stir the potatoes and onion and cook between 25-30 minutes, or until the potato rounds are cooked through.","Add the garlic to the pan and stir for about 30 seconds.","Remove the pan from heat.","In a clean bowl, add the eggs and briefly beat.","Stir in the potato/onion mixture, parsley, 1/4 tsp salt, and black pepper and stir until combined.","Put the skillet on the stove over medium heat and add enough oil to coat the bottom.","Pour the bowl of egg mixture into the pan and let cook between 5-6 minutes. Use a rubber spatula to occasionally lift and check the bottom of the tortilla.","Once the bottom of the tortilla is browned (the top surface of the tortilla may still be quite runny), use a spatula to quickly and gently slide the entire tortilla to a clean heatproof plate that has a diameter larger than the pan.","Flip the skillet upside down and place on top of the tortilla on the plate. Using hotpads, grab the skillet and plate (with the tortilla inside) like you would a sandwich and quickly flip the entire unit so that the plate is now on top.","Return the pan to the stovetop and cook for another 4-5 minutes until the bottom is browned and the tortilla is cooked through.","Remove the tortilla from the pan and allow to cool. Serve warm or at room temperature.","Store leftovers in the refrigerator."],"images":["https://i.ibb.co/zGS8Rt7/tortilla1.jpg","https://i.ibb.co/hg45Fp4/tortilla2.jpg"],"is_published":true,"publish_date":"2020-08-04T14:52:53.805Z","created":"2020-10-27T01:12:19.302Z","title":"Spanish Tortilla","duration":55,"intro":"In 2014, a chef in Spain used over two tons of eggs and potatoes in an attempt to cook the world’s largest Spanish tortilla. Today, you’ll scale things down a bit and use a mere six eggs to produce a cozy, plate-sized Spanish tortilla you can call your own.\n\nMy brain splits a million ways during the last few minutes of cooking a hot meal. I think about how I will plate the food, in which order the food should be plated, if the table is set and ready, if the drinks are poured, if the cold components are arranged and served, etc. Cooking a Spanish omelette is different. You (generally) eat it warm or at room temperature, those last few minutes of cooking go from being stressful to blissful. And there’s nothing you can do about it.\n\nI first saw a Spanish tortilla in a photograph in one of my Mediterranean recipe books. I cooked it and loved it. Later that year I traveled to Spain and stayed with a lady who coincidentally was cooking tortillas with her friends for a party that night. I remember looking at a table full of tortillas, seeing that each one was noticeably different than the rest. Some were quite oily, some had more potato than egg, some were thick, some were thin, and one was wrapped in foil (huh?). To make things worse, everyone kept feeding me contradicting tips on how to make the best tortilla. Long story short, there are many correct ways of preparing a tortilla. And that’s good news indeed, for you and for me.\n\nWith that being said, here are a few tips based on my experience. Number one, don’t lose your patience during the half hour you are cooking the potatoes and onion. Oh boy, speaking of onion, it’s time for another sidenote. To include or not include onion in a tortilla is a highly disputed matter among Spanish tortilla makers. I add the onion, but I won’t shame you for leaving it out. Anyway, patience is needed. You need to be fairly active during the 30 minutes of cooking the potatoes and onions or else something will burn and the potatoes will not cook evenly.\n\nFlipping the tortilla can be a bit awkward at first. I speak from experience(s). I find that speed is my best friend during the process. When sliding the tortilla out of the pan and on to a plate, a slow slide could result in a dismembered half-cooked tortilla. It happens. So be confident and make the transition quick. The same principle applies to when you actually flip the plate-tortilla-skillet sandwich. Rotate too leisurely and your tortilla might transform into a strange shape inside the pan. At the same time, be careful! You are grabbing a hot metal pan, and metal pans and glass plates are essentially frictionless; don’t let one slide out from the other!\n\n&amp;amp;amp;lt;p&amp;amp;amp;gt;\nUse your best judgement on when the tortilla is done. It’s a bit ugly to dig into the middle of your tortilla with a knife to test for doneness, but it might be worth it the first few times in order to gauge how long it needs to be cooked.&amp;amp;amp;lt;&amp;amp;amp;#x2F;p&amp;amp;amp;gt;","quote":"It’s breakfast. It’s lunch. It’s dinner.","size":"2 - 3","description":"Also referred to as a Spanish omelette, this egg and potato dish pairs wonderfully with a side salad of bitter greens, tomatoes, and a sweet vinaigrette.","keywords":"Minimal ingredients, traditional, eggs, potatoes,","prep_time":10,"cook_time":45,"category":"Lunch, Dinner","cook_method":"Fry","cuisine":"Spanish","ratings":[5],"__v":0,"newsletter":false}
{"_id":"5f0053535c113b000820265a","_type": "recipe", "ingredients":["400 g (2 cups) sweet potatoes, 2.5 cm (1 in) cubes","1 large carrot, 2 cm (1/2 in) slices","3 Tbsp vegetable oil","1 large onion, diced","1 Tbsp ginger, minced","1 large garlic clove, minced or pressed","1 tsp cumin","1 tsp curry powder","1 tsp turmeric","65 g (1/2 cup) green olives, sliced","240 g (1.5 cups) cooked black beans","180 g (1 cup) cooked quinoa","1 Tbsp minced fresh basil","60 g (1/2 cup) bread crumbs"],"steps":["Put sweet potatoes, carrots, and 2 tsp salt in a medium pot and cover with water. Bring to a boil and then simmer for about 10 minutes until the potatoes are fork-tender. Drain and set to the side.","Heat a large skillet over medium-high heat. Once hot, add 2 Tbsp oil.","Add onion, ginger, and 1/2 tsp salt. Cook for 5 minutes, stirring frequently.","Add garlic and spices (cumin, curry, turmeric) and stir constantly for 30 seconds.","Add potato/carrot mixture, olives, and beans and cook 4-5 minutes. Stir frequently.","Remove skillet from heat and transfer contents to a large bowl. Add quinoa, basil, bread crumbs, 1/4 tsp salt, and a generous amount of black pepper. Mash together with a fork, potato masher, or your hands until you obtain a cohesive mixture.","Form patties using 80 g (1/3 cup) mixture per patty. Allow patties to chill for at least 30 minutes.","When ready to cook, heat a large skillet over medium-high heat. Once hot, add 1 Tbsp oil. Fill the bottom of the skillet with patties, but avoid overcrowding. Cook patties 3-5 minutes, flip, and cook the other side 2-4 minutes. "],"images":["https://i.ibb.co/7WgtHZq/veg-burger1.jpg","https://i.ibb.co/7XB3JjF/veg-burger2.jpg","https://i.ibb.co/xLdyt1h/veg-burger3.jpg"],"is_published":true,"publish_date":"2020-08-09T05:01:47.613Z","created":"2020-10-27T01:12:19.302Z","title":"Sweet Potato Black Bean Burger","duration":105,"intro":"Today’s color theme is inspired by the 2011 Nike Air Max 90 sneakers. I joke, but the first several results that pulled up after typing in “orange black yellow” were related to these shoes. Now the question is, do I change the name of this recipe to the “Air Max 90 Burger?” Tempting. Definitely tempting.\n\nI make vegetable-based burgers quite regularly, always changing the ingredient combinations in search of winner flavors. The set of ingredients you see in this recipe consistently make it back to my menu. The flavors are rich, the colors are bold, and the smell of the patties cooking is like no other.\n\nVegetable-based burgers tend to not hold together as well as their meat counterparts, so let me offer a few experience-based pieces of advice that you can choose to incorporate or not.\n\nTurmeric is terrifying! Don’t let its sublime earthy aroma fool you. Turmeric will stain that countertop of yours. A few years ago I was staying in an Airbnb with some family members. I was in charge of cooking that night and was looking at the spices in the kitchen cabinet for some culinary inspiration. The jar of turmeric caught my eye and kickstarted the evening meal. I can’t remember what I cooked, but I do remember that at some point I spilled a decent amount of the turmeric powder onto the counter and into the sink. Being unaware that turmeric is a tattoo artist, I didn’t wipe it up immediately. Oops. Later, after scrubbing, scrubbing, and scrubbing, the yellow splotches remained. Eventually we decided to call a relative, an organic chemistry professor, and asked for help. He told us what household ingredients to use to lift the stain, and it worked! If I remember correctly, it involved us rubbing vegetable oil into the stain, and then lifting it complete with dish soap. I think. Don’t trust me on this one. Morale of the story: don’t spill the turmeric while making these burgers.\n\nYou’ll notice in step seven I indicate you should refrigerate the raw patties for 30 minutes. If you have the time, do it longer! The burgers will hold their shape better and will crumble less once they are in the skillet if you have put in the chilling time. \n\nBack to you cooking these refrigerated patties. Be sure to preheat your skillet. To get a nice seared crust, the patties need to come into contact with hot oil in a hot pan. I say medium-high in the instructions, but another option is to start the burgers at high heat and drop to medium-high after about a minute. The upside to the consistency of these burgers is that you can reshape them while cooking to get a nice round patty. The downside is that you need to be quite a bit more gentle when handling them, especially compared to a meat burger.\n\nWhen the burgers are done and it’s time to eat, serve as you wish. I usually go the classic route with mayonnaise and ketchup on toasted buns, topped with lettuce and tomato. Enjoy!","quote":"Turmeric in a burger? Yes, please.","size":"6-8","description":"These burgers are composed of some powerful ingredients that pull together remarkably. One of the powerful ingredients, turmeric, has a wild earthy flavor that is noticeable in the final product. But! Turmeric stains, so clean it up immediately if it spills.","keywords":"Vegetarian, turmeric, sweet potato, orange, yellow, black beans","prep_time":90,"cook_time":30,"category":"Lunch, Dinner","cook_method":"Boil, Fry","cuisine":"Fusion","ratings":[5,5],"__v":0,"newsletter":false}
{"_id":"5f0985018b6c370007ba45da","_type": "recipe", "ingredients":["3 fresh sausages or 3 Kielbasa sausages","45 mL (3 Tbsp) olive oil","2 carrots, cut into 1.5 cm (0.5 in) slices","1 yellow bell pepper, cut into 2.5 cm (1 in) pieces","1 red bell pepper, cut into 2.5 cm (1 in) pieces","2 onions, cut into 2.5 cm (1 in) slices","4 garlic cloves, peeled and left whole","2 large tomatoes, cut into wedges","1/2 tsp dried thyme","1/8 tsp red pepper flakes","1 tsp coarse sea salt","Black pepper","Baguette and butter for serving"],"steps":["Turn on the oven broiler and position the oven rack in the upper third of the oven.","Heat a skillet over high heat on the stove. Add 1 Tbsp olive oil once hot.  Cook the sausages for 2-3 minutes per side just until the outside of the sausage is nicely browned.","If cooking raw sausages, leave the casing intact. If using Kielbasa, use a knife to score the sausages every few centimeters or so.","Position the sausages and all the vegetables on a sheet pan. Sprinkle the thyme, red pepper flakes, sea salt, and black pepper over contents of the pan. ","Broil in the oven for about 15 minutes. Serve with a warm baguette and butter."],"images":["https://i.ibb.co/nL0D7t6/boudin2.jpg","https://i.ibb.co/DgBRQWX/boudin1.jpg","https://i.ibb.co/LRStF1y/sheet-pan-sausage.jpg"],"is_published":true,"publish_date":"2020-11-03T15:15:31.991Z","created":"2020-11-03T04:33:21.755Z","title":"Sheet Pan Sausage and Roasted Vegetables","duration":40,"size":"3","intro":"I have crafted an ode to the mighty sheet pan:\n\nYour rectangular shape is unceasing,\nMy respect for you daily increasing,\nIn the oven you bake,\nIn the fridge you hold cake,\nSo I’ll keep you around for a while.\n\nBut really, sheet pans are where it’s at. They come in a variety of sizes, they nest inside each other for storage, and they are a dream to clean if you use parchment paper or a silicone mat. If you haven’t expressed gratitude for your sheet pan recently, take a brief moment the next time you two meet up to do so. Today’s recipe uses a sheet pan, so that moment of gratitude might come sooner than you were expecting.\n\nA few months ago I read a recipe for a sheet pan sausage dish that was written in a single paragraph. No specific ingredients, no quantities, and no explicit instructions. Just a brief explanation written by a chef about how he prepares the dish. Although the paragraph gave me little direction, it inspired me to go about creating my own recipe that features roasting sausages and vegetables on a sheet pan in the oven. I really wish I could remember where I read the aforementioned paragraph, but sadly I nor Google Chrome History can do so. We’re lame-o’s, I know.\n\nI’ve made this dish on several occasions, each time trying a different type of sausage. The particular version pictured on this page was made with boudin blanc sausages. I think this may be my favorite sausage to cook with this dish. With that said, be brave when at the supermarket and snag the type of sausage off the shelf that you would like to eat. It’s hard to go wrong, and it’s good to experiment. Did that last sentence come from a fortune cookie? Good question.\n\nWhat really makes this dish a gem is the congregation of vegetables that are roasted alongside the sausages. Carrots offer a warm, homey flavor. Bell peppers radiate that classic roasted-bell-pepper taste and smell. Onions petals char at the edges and offer a sweet, toned-down onion flavor. Tomatoes soften in texture, while still providing a juicy bite. Dried thyme and dried red pepper flakes are sprinkled over everything to give everything just a little extra oomph.\n\nThe secret is to keep the sheet pan goodies in the oven for a short period of time at a high temperature, hence setting the oven to broil. Cook the vegetables for too long, and they’ll lose the fresh, crisp texture you are aiming for. Cook the vegetables at a lower temperature and you won’t get the charred skin and edges that provide the “roasted” flavor.\n\nIf you need a relatively easy dinner party trick, this is a good one.","quote":"An ode to the mighty sheet pan.","description":"The sausages may appear like the stars of the show when the sheet pan comes out of the oven, but this dish would be almost nothing if it weren’t for the roasted vegetables. Cozy carrots, charred onion petals, roasted bell peppers, and tender tomatoes ensure that each bite is fresh and rich with flavor.","keywords":"Sausage, sheet pan, roasted, vegetables, fast","prep_time":20,"cook_time":20,"category":"Dinner","cook_method":"Fry, roast","cuisine":"American","ratings":[5],"__v":0,"newsletter":false}
{"_id":"5f0992bb2305110007baf648","_type": "recipe", "ingredients":["500 g (1 lb) bone-in pork chops","30 mL (2 Tbsp) neutral oil","2 medium shallots, minced","1 Tbsp ginger, minced","1/4 tsp salt","2 garlic cloves, minced or pressed","30 mL (2 Tbsp) apple cider vinegar","26 g (2 Tbsp) brown sugar","1 tsp brown or whole grain mustard","1/2 tsp prepared horseradish or cream style horseradish","160 mL (2/3 cup) dry white wine","7 g (1 Tbsp) cornstarch","15 mL (1 Tbsp) water","3 large peaches, 6 mm (1/4 in) slices","10 g (1/2 cup) basil, chopped"],"steps":["Begin by preparing the sauce. Combine garlic, cider vinegar, brown sugar, mustard, horseradish sauce, and wine in a small bowl. Whisk until combined.","Heat a large oven-proof skillet (preferably cast-iron) over high heat. Add 1 Tbsp oil. ","Sear pork chops about 3 minutes per side. Remove pork from skillet and set aside.","Decrease heat to medium-high and add remaining 1 Tbsp oil. Cook shallots, ginger, and 1/4 tsp salt for 5 minutes.","Decrease heat to low. Return pork chops to the skillet. Pour the sauce over the pork. Cover the skillet with a lid or aluminum foil and cook for about 1 hour.","Meanwhile, combine cornstarch and 1 Tbsp cold water. Stir until combined.","Near the end of the 1 hour period, turn on the oven broiler.","Remove the pork chops from the skillet and increase heat to medium-high. Add the cornstarch mixture and simmer while stirring for 2 minutes, or until sauce has thickened.","Remove from heat and return the pork chops to the skillet. Flip once to coat with the sauce. Top with the peach slices.","Transfer the skillet to the oven and broil for 4-5 minutes.","Top with chopped basil and serve."],"images":["https://i.ibb.co/2qRH7dj/pork-chops1.jpg","https://i.ibb.co/dDJCNcy/pork-chops2.jpg"],"is_published":true,"publish_date":"2020-09-15T11:52:46.361Z","created":"2020-10-27T01:12:19.302Z","title":"Braised Pork Chops with Peach and Basil","duration":90,"size":"2","intro":"Here we are, more or less nearing the end of peach season. This one is a tribute to our fuzzy friends. To start, spin up the song “Peaches” by the 90s grunge-rock band The Presidents of the United States of America. Put that track on infinite repeat. As soon as you hear the first few guitar strums, verify the volume is at rock level, and take your rightful place in the kitchen. You are now absolutely ready.\n\nWhat you are about to cook has four primary components. Savory pork, sweet peaches, peppery basil, and an energetic sauce. The pork&amp;#x2F;peach&amp;#x2F;basil combination is plastered all over the internet. I decided to take this trio and create a punchy sauce that would be tamed by the thick sweetness of the peaches. The power of the sauce comes from a blend of a few intense ingredients - shallots, ginger, garlic, strong mustard, and horseradish. Exciting, amirite??\n\nTechnically I think you could call this one a one-pot wonder. Everything (the searing, the pan-frying, the braising, the broiling) happened in my prized 12-inch cast iron skillet. How much do I love my cast iron skillet, you might ask? Enough to hand-wrap it in paper towels and bubble-wrap and move it across the Atlantic not once, but twice. Shout out to you, cast iron skillet. With that said, all you really need is an oven-proof pan with a lid. The choice is yours.\n\nWhen searing the pork, inactivity is key. The recipe says to sear for three minutes per side. That means laying the pork chops in the hot skillet at timer reading 0:00 and not moving them at all until about three minutes later.\n\nWhen it comes time to braise, refrain from adding the peaches to the pan unless you want fall-apart, cobbler-like peaches. Wait until the braising period is over to add the peaches. The quick broil at the end will heat the peaches and ideally result in a few caramelized edges. Seal the deal by topping the whole dish with freshly chopped basil leaves. \n\nAs a serving suggestion, I recommend a side of quinoa. Spoon some of the extra sauce from the pan onto the quinoa and complete the whole thing with a few grinds of black pepper. Enjoy.","quote":"For the fuzzy friends.","description":"Time to practice your searing, pan-frying, braising, and broiling skills all with one single pan. In this recipe you will bring together savory pork, sweet peaches, peppery basil, and a punchy sauce. This one is a do-it-soon-because-peach-season-is-almost-over sort of dish.","keywords":"summer, basil, peaches, pork, braise","prep_time":15,"cook_time":80,"category":"dinner","cook_method":"sear, fry, braise, broil","cuisine":"american","ratings":[5],"__v":0,"newsletter":false}
{"_id":"5f09a6d5d9c40e00076dd582","_type": "recipe", "ingredients":["300 g (1.5 cups) basmati rice","600 mL (2.5 cups) water","1.5 tsp salt","1 tsp dried chives","1 tsp dried oregano","15 mL (1 Tbsp) olive oil","3 large cloves garlic, thinly sliced","150 g (5 oz) hard Spanish chorizo, sliced into 3 mm (1/8 in) rounds","1 large onion, thinly sliced","1 green bell pepper, cut into thin strips","200 g (7 oz) fresh spinach","Juice of 1/2 lemon","Black pepper"],"steps":["In a colander, rinse the rice under cool water for 2 minutes. Then put the rice in a bowl and cover with water. Let sit for 15 minutes. Return rice to a colander and allow to drain for another 15 minutes.","Combine rice, water, chives, oregano, and 1/2 tsp salt in a medium pot. Bring to a boil over high heat. Cover, decrease heat to low, and simmer for 13 minutes.","Remove rice from heat and keep covered for another 10 minutes. Then fluff with a fork and set aside with the lid ajar while you continue with the recipe.","Heat a large skillet over medium-high heat. Add the olive oil once hot. Cook the garlic for about 4 minutes until browned, stirring constantly. Garlic can easily burn, so be careful. Keeping the oil in the pan, use a fork or slotted spoon to transfer the garlic to a plate lined with a paper towel.","Add the chorizo to the pan and cook for about 3 minutes until the chorizo slices begin to curl and a decent amount of grease has been released. Keeping the oil in the pan, transfer the chorizo slices to a plate lined with a paper towel.","Decrease heat to medium and cook the onions for 5 minutes. Add the bell pepper and cook for another 4 minutes.","Add the spinach and stir for 2-3 minutes until the spinach is wilted and soft.","Return chorizo to the pan and add lemon juice and 3/4 tsp salt. Add the cooked rice to the pan. Remove from heat and stir until well combined. Stir in the toasted garlic and serve."],"images":["https://i.ibb.co/1b1Yfwh/rice-bowl.jpg"],"is_published":true,"publish_date":"2020-10-13T06:33:47.097Z","created":"2020-10-27T01:12:19.302Z","title":"Garlic and Spanish Chorizo Rice Bowl","duration":55,"size":"4","intro":"One of the core elements of the hardcore genre is the breakdown. It’s the musical moment when the screaming guitar riffs go quiet, the overall beat slows down, and the sludgy bass drum invites listeners to clump together for the classic mosh pit. Whether you like the angsty genre or not, take the opportunity at least once in your lifetime to listen to a hardcore song, wait for the breakdown, and let loose in your personal mosh pit.\n\nToday’s breakdown is called the Chorizo Breakdown. Chorizo can be confusing. I’ve made a fair amount of chorizo blunders myself, so I’m going to share with you what I’ve learned about this poignant pork product.\n\nFirst, chorizo is not only found in Mexican cuisine. In the United States, Mexican chorizo is definitely the most common type found at supermarkets due to the proximity of the two countries. It’s primarily seasoned with vinegar and chile peppers, and is sold as raw, fresh sausage. Go for a whirl around the world though, and you’ll find chorizo variations in Asia, South America, Europe, and the Caribbean. Say what.\n\nIn this recipe you’ll be using Spanish chorizo. Uh oh, there is more than one type of chorizo within Spain as well. Time for another Chorizo Breakdown. In general, chorizo found in Spain is fully-cooked. The difference lies in whether the sausage is semi-cured or fully-cured. Semi-cured chorizo is labeled as “soft” and is typically used in stews or grilled dishes. Fully-cured chorizo is labeled as “hard” and is what you will be working with today. Hard Spanish chorizo is similar in firmness to salami and can be sliced and served as-is.\n\nWhat I’m trying to say with all this is that you cannot simply pick up a package of Mexican chorizo and substitute it in for Spanish chorizo. They’re different in so many ways, but they have the same name. Hopefully you see why the chorizo confusion is real, and hopefully my rambling has given you a dose of chorizo clarity.\n\nNow a bit on the actual recipe. A few years ago I made a New York Times recipe that features chard and chorizo. Here’s the funny part. The recipe called for raw (Mexican style) chorizo. Being chorizo ignorant and living in a country that neighbors Spain, I used hard Spanish chorizo. This totally contradicts what I said earlier about chorizo styles not being interchangeable, but the dish was amazing. My error inspired the development of the recipe you are making today.\n\nThe rice bowl is rich in flavor. The white rice will soak up all the juice in the pan that comes from cooking the chorizo, onion, bell pepper, spinach, and lemon. This ensures that every bite contains many mini parcels of flavor. My main piece of advice is be quite vigilant when frying the garlic slices. Garlic can go from nearly raw to extremely burnt in a matter of seconds. Stir constantly and quickly remove the slices from the pan when the garlic is a light almond color. If toasted correctly, you’ll end up with a delectable, crispy garlic chip that will get crumbled into the rice bowl.\n\nEnjoy this one.","quote":"Here comes the breakdown.","description":"Take a trip around the world and you’ll find variations of chorizo all over. Today’s recipe features hard Spanish chorizo. After progressively frying the chorizo, bell pepper, onion, and garlic, the remaining infused cooking oil soaks into the rice and ensures a rich blend of flavors in each bite.","keywords":"chorizo, spanish, rice, rice bowl, toasted garlic","prep_time":30,"cook_time":50,"category":"lunch, dinner","cook_method":"fry, boil","cuisine":"Spanish, American","ratings":[5],"__v":0,"newsletter":false}
{"_id":"5f1bec159bfbde00085ee39c","_type": "recipe", "ingredients":["250 g (8 oz) lardons or thick bacon cut into 6mm (1/4 in) matchsticks","1 medium shallot, minced","15 mL (1 Tbsp) white wine vinegar","1 Tbsp white vinegar","1 Tbsp strong mustard","60 mL (1/4 cup) olive oil","6 eggs","100 g (3.5 oz) arugula or frisée (or a mix!)","salt and pepper","1 baguette","butter (for serving)"],"steps":["Heat a small or medium skillet over high heat and fry lardons/bacon for 5-6 minutes until browned. Transfer to a paper towel-lined plate, leaving the rendered oil in the skillet.","Return the skillet to the stove and decrease the heat to medium-high. Fry the shallots for 3 minutes. Remove the skillet from heat and stir in the white wine vinegar, mustard, olive oil, and 1/4 tsp salt until combined. This is the dressing.\n","Fill a small saucepan with about 7 cm (2.5 in) water and bring to a boil. Reduce to a simmer and add the white vinegar. Crack one egg into a small teacup or heat-resistant measuring cup. Gently dip the cup into the saucepan and release the egg into the simmering water. Simmer for about 4 minutes, then carefully remove the egg with a slotted spoon and transfer to a plate. Repeat until all eggs are poached. I generally poach two eggs simultaneously in the same pan.","To assemble, divide bitter greens into salad bowls. Top with lardons/bacon and then pour over the dressing. Carefully slide two poached eggs onto each salad. Season eggs with salt and cracked pepper. Serve with baguette and butter."],"images":["https://i.ibb.co/gMNHvfX/salade-lyonnaise2.jpg","https://i.ibb.co/S005cNK/salade-lyonnaise.jpg"],"is_published":true,"publish_date":"2020-09-08T08:58:49.026Z","created":"2020-10-27T01:12:19.302Z","ratings":[5],"title":"Salade Lyonnaise","size":"3","intro":"Mère in French translates to mother. In France during the 18th century, the word mère became a title for a (normally) untrained female cook. Why is this important? In Lyon, a city in the east of France, the mères ran the culinary show, not their formally trained, potentially pretentious male counterparts. The mères grew in number during the Great Depression as women, recently fired as cooks for bourgeois families, banded together and joined the crew. The mères of Lyon helped define the gastronomy of Lyon. Remember that.\n\nA few years ago I spent a year living in Lyon and got my first taste of the regional cuisine. The city itself has a few handfuls of traditional restaurants called bouchons where you can order dishes that were developed by the original mères. Eel stew, pork offal sausage, praline tart, tripe soup, blood sausage with warm apples, it’s all there for you to try. One of the most popular dishes, and the one we are making today, is Salade Lyonnaise. Think comfort food, think salade Lyonnaise.\n\nOverall, the salad is a relatively simple combination: bitter greens, fried bacon, poached eggs, some bread, and a vinaigrette. Eating it, though, feels anything but simple. You cut into an egg, and the rich yolk spills onto a few crips leaves of arugula and salty pieces of bacon. Seizing the opportunity, you use your fork to claim that perfect bite. Immediately you sense the sharp tang of the white wine and mustard vinaigrette. Soon after, the warmth of the creamy yolk and the fatty bacon mix with the bold bitterness of the arugula to round out the savory experience. Then, you do it again. At the end of it all, you use pieces of your warm, fresh baguette to sop up the remaining dressing and yolk from the bowl. \n\nSo, the most difficult step in preparing this salad is the poached egg. Poached eggs can be moody. I am not professionally trained in the ways of the egg, and by no means am I an expert, but I can share what I have learned through experience regarding what works best for me when poaching an egg.\n\nWhile you’re heating the water you’ll use for poaching, find a small teacup or a heat-resistant measuring cup. I usually do this with a ½ cup measuring cup. Crack one egg into the cup. Make sure whatever cup you use has a decent handle, as you’ll be gently tipping the egg from the cup into the water.\nThe first few times I poached an egg I did it with the water at a full on, rolling boil. Don’t do it. You can bring the water to a boil, but reduce it to a simmer before even thinking about adding an egg. Once the water is simmering, add the vinegar. The vinegar makes the water more acidic, which in turn helps coagulate and firm up the egg whites quicker, which helps the egg keep its shape, which is awesome. Some people vote no when it comes to vinegar. I vote yes.\n\nSo the vinegar water is simmering, your measuring cup has a raw egg in it, and you’re feeling ready to poach. Take the measuring cup, lower it to the surface of the water, and gently dip the egg into the water. You don’t want your egg going for a skydive. There should be no dropping. Think of what it’s like to gently lower yourself into a hot tub. That’s what the egg should experience. I usually poach maximum two eggs simultaneously. Any more than that and the pan gets too crowded and the quality of the poached eggs seems to decrease.\n\nThe rest of the salad is pretty easy to put together. I mention lardons in the list of ingredients. This is an extremely common ingredient in France. It’s just slab bacon cut into matchstick pieces. So find some very thick slices of bacon, and cut them into matchsticks.\n\nGood choice deciding to make this. The mères of Lyon would be very proud of you.","quote":"Thanks to the Mothers.","description":"Poached eggs, bacon, and bitter greens, served with a mustard vinaigrette and a fresh baguette. This salad comes from Lyon, a city in eastern France with a rich cuisine developed by a group of women called the Mothers of Lyon (mères lyonnaises). Learn the ropes of poaching an egg, and throwing together a Salade Lyonnaise will be a breeze.","keywords":"Salad, bacon, poached egg, french, mères, Lyon","prep_time":15,"cook_time":30,"category":"Dinner","cook_method":"Poach, Fry","cuisine":"French","__v":0,"newsletter":false}
{"_id":"5f1bf179a152440008aac033","_type": "recipe", "ingredients":["1 large cucumber, peeled and diced","1 large red bell pepper, seeded and diced","1 medium shallot, minced","1 kg (2 lbs) ripe beefsteak tomatoes","2 small garlic cloves, minced or pressed","240 mL (1 cup) tomato juice","30 mL (2 Tbsp) white wine vinegar","15 mL (1 Tbsp) olive oil + more for serving","15 mL (1 Tbsp) lemon juice","80 mL (1/3 cup) cold water","1.5 tsp salt","1/2 tsp freshly ground black pepper"],"steps":["In a large glass or stainless-steel bowl, combine cucumber, bell pepper, shallot, and garlic.","Remove the seeds and juice from the inside of the tomatoes. Put the seeds and juice into a medium bowl. Take two of the now seeded tomatoes, coarsely chop, and add to the bowl. Use an immersion or stand blender to puree the tomato innards and two chopped tomatoes. Add the puree to the bowl of diced vegetables.","Dice the remaining tomatoes and add to the bowl.","Add the tomato juice, vinegar, olive oil, lemon juice, cold water, salt, and black pepper. Stir to combine.","Cover bowl and refrigerate for about 5 hours. ","After refrigeration, add additional salt if needed. Serve in bowls and top with a drizzle of olive oil. Pair with ham, hard-boiled eggs, and a loaf of crusty bread."],"images":["https://i.ibb.co/BVq2gtD/gazpacho1.jpg","https://i.ibb.co/ByxQFb0/gazpacho2.jpg"],"is_published":true,"publish_date":"2020-08-14T08:47:08.707Z","created":"2020-10-27T01:12:19.302Z","ratings":[],"title":"Chopped Gazpacho","size":"4","intro":"The world of chilled soup blows my mind. Normally soup is incredible in the dead of winter and torture for the tongue on a sunny summer day. Cold soup is the complete opposite. If this is your first chilled soup, welcome. Don’t let this one be the only one you try. Find the peach soups, the yogurt soups, the avocado soups, and the sweet corn soups, and your picnics will go from meh to ‘mazing.\n\nThere are two “B” words that are lacking in this gazpacho recipe: bread and blender. Let’s start with bread. I will admit I was completely surprised when I first learned that real, authentic, genuine, bona fide gazpacho features stale bread. Ignorance happens, you know. This version intentionally omits bread, but definitely try out some of the more authentic gazpacho recipes to get a taste of the real deal. \n\nOn to the blender. Gazpacho is normally pureed and thin enough so that it is sometimes even served in drink form. Again, this version strays from tradition and nearly cuts out all of the pureeing. I say nearly because you will puree a small quantity of the tomatoes to add to the liquid base. As indicated by the title, the majority of the vegetables are chopped and remain in that chopped state until the spoonful hits your mouth. I’m not against pureed gazpacho, but I’m definitely all for the texture and crispness of this chopped variation. So much that I decided to feature it here.\n\nAfter a few years of making gazpacho with onions and feeling like the intensity of the onion flavor more often than not dominated in comparison to other present flavors, I decided to try leaving it out. The result was unsatisfactory. So what did I do? I tried shallots. When raw, I tend to prefer shallots over onions. The flavor is a bit sweeter and the intensity a bit less harsh. With that said, feel free to substitute onion for shallot.\n\nWhen you combine all the ingredients in a bowl, make sure the bowl is non-reactive. The safest thing to do is use a glass or ceramic bowl. Stainless steel should be okay, but what if you have that metal bowl in your drawer you think is stainless steel, and it’s really aluminum?? Combine tomatoes and aluminum and you’re talking discoloration, bitterness, and metal-flavored gazpacho. And that’s not cool. So, my suggestion is to go with glass or ceramic.\n\nIf you look at practically any gazpacho recipe you’ll see somewhere in the instructions an indication that the soup needs to sit, usually in the refrigerator, for at least a few hours before being consumed. Here I am, another voice on the internet, telling you that your soup definitely needs to sit for at least a few hours before being consumed. During that time, the individual vegetables come together, hold hands, and blend in a way that results in an incredibly balanced spoonful of flavors.","quote":"Chill, and don’t be in the soup.","description":"Wander a few steps from the traditional version of this chilled soup by leaving out the bread and keeping the vegetables chopped instead of pureeing them. Go one step further by substituting shallots for onions. Let it all meld a while and you’ll have a harmonious bowl of gazpacho to enjoy on a hot day.","keywords":"Spanish, cold soup, summer, garden","prep_time":20,"cook_time":300,"category":"Lunch, Dinner","cook_method":"Chopped","cuisine":"Spanish","__v":0,"newsletter":false}
{"_id":"5f1bfba367120a00082a1409","_type": "recipe", "ingredients":["500 g (1 lb) red beets","1 large shallot, minced","2 medium garlic cloves, minced or pressed","85 g (3 oz) shelled pistachios","60 mL (1/4 cup) olive oil, divided","pinch of cayenne pepper","7 g (1/4 cup loosely packed) basil leaves, coarsely chopped","200 g (7 oz) plain cream cheese","1 small bunch red radishes, thinly sliced","1 loaf sourdough bread, sliced and toasted"],"steps":["Heat oven to 200° C (400° F). Wash beets and wrap them individually in aluminum foil. Place beets in a roasting pan and cook in oven for about 60 minutes, or until fork tender. Don't worry if the beets take longer as size can affect the cooking time. Rotate beets 2-3 times during the cooking period. ","While the beets are cooling, heat a small skillet over medium-high heat. Once hot, add 1 Tbsp olive oil. Add shallots and 1/2 tsp salt and fry for 5 minutes. Add garlic and cayenne pepper and cook for an additional 30 seconds.","Peel and coarsely chop the cooked beets. Combine the beets with the shallot mixture and puree with an immersion or stand blender until you have a consistency that resembles applesauce. Set aside.","For the pistachio crumble, use a blender or a small food processor. Blend the pistachios, 3 Tbsp olive oil, basil, and 1/4 tsp salt until a coarse, crumbly consistency is obtained. Avoid blending to a paste.","To assemble, spread a generous layer of cream cheese on each slice of bread. On top of the cream cheese, spread an equally generous layer of the beet mash. Sprinkle or spoon 1-2 tsp of the pistachio crumble on top. Add a few radish slices and serve. "],"images":["https://i.ibb.co/G2LykGw/beet-toast.jpg"],"is_published":true,"publish_date":"2020-10-06T09:31:16.336Z","created":"2020-10-27T01:12:19.302Z","ratings":[5,5],"title":"Beet Mash and Pistachio Crumble Tartine","size":"4","intro":"If you really want to know, I’m colorblind. Blue looks like purple. Green looks like yellow looks like orange. Red looks like brown looks like dark green. I get confused a lot. The great thing about it all is that two contrasting colors that might look dull to my friends sometimes look incredible to me and make me say “woah!” The bad news is that I cannot for the life of me spot a bright red poppy in a green summer meadow. The reason I am telling you all of this is because I was just staring at the photograph I’m posting for this recipe and for a moment felt pretty confident about recognizing the colors of the ingredients: green, red, white, brown. Then I looked out the window and saw the surrounding mountains, valleys, and sky in the morning light and my color-confidence faded. Is that field macaroni and cheese or burnt sienna? Anyway, to the recipe.\n\nI was first introduced to vegetable mashes when reading one of Mollie Katzen’s recipe books. The dish I’m presenting today is inspired by her culinary creativity. With that said, I’ll introduce today’s tartine layer by layer, from the ground up. By the way, tartine is just a fancy French word for an open-face sandwich. Not only does it sound elegant, it also makes the title of my recipe a bit shorter ¯&amp;#x5C;_(ツ)_&amp;#x2F;¯ \n\nAt the base of this dish is a slice of sourdough bread. Make some or buy some, just find some bread with a strong flavor. You might want to toast the slices of bread so that all of the toppings have a solid base to sit upon.\n\nFirst on the slice of bread is a layer of cream cheese. The creamy flavor blends nicely with the strong tastes of the beet mash and pistachio crumble.\n\nNext up, the main character. I consider the beet mash to be the star of the show. Beets have a sweet earthy flavor. Alone they can sometimes taste like a mild candy bar handmade by Mother Nature herself. You’ll roast the beets in the oven. More than once have I lost patience while roasting beets. Don’t do it. Leave them in until they are fork-tender. In the recipe I say to roast them for about one hour, but it really depends on the size of your beets. If you want to make things easier on yourself, buy small to medium sized beets and you’ll find your cooking time to be closer to one hour. Large beets take forever, yes they do.\n\nSo to the sweet, roasted beets you will be adding some shallot, garlic, and cayenne pepper. This results in a sweet and slightly spicy flavor combination. Pair that with the creamy cream cheese and you’ll find that nothing can go wrong.\n\nThe pistachio crumble consists of pistachios, olive oil, basil, and a touch of salt. It all gets blended and crushed into a bright, coarse crumble that sits proudly on top of the dark beet mash. Just remember to not over-blend the pistachio mixture. You want a crumble, not a paste.\n\nFinish the whole thing off with a few radish slices positioned in the upper corner of each tartine. I usually serve this with some soft goat cheese. Enjoy!","quote":"Beets are still really cool.","description":"Start with a tangy slice of sourdough bread. Spread a smooth layer of cream cheese from edge to edge. Add a generous coating of the sweet and slightly spicy beet mash. Top with a spoonful of the basil-pistachio crumble. Finally, garnish with a fan of peppery radish slices.","keywords":"vegetarian, beets, pistachio, tartine, open-face","prep_time":20,"cook_time":70,"category":"lunch, appetizer","cook_method":"puree, roast, fry","cuisine":"vegetarian","__v":0,"newsletter":false}
{"_id":"5f1d34bbd33ddf000850c5d5","_type": "recipe", "ingredients":["1 large head of cauliflower","1 large red bell pepper","75 mL (5 Tbsp) olive oil","1 tsp salt","1/4 tsp red pepper flakes","1 large yellow onion, diced","4 cloves garlic, minced or pressed","14 g (1 Tbsp) butter","400 g (14 oz) can of crushed/pureed tomatoes","200 mL (7 oz) heavy cream","4 tsp brown mustard","1/2 tsp dried dill","500 g (1 lb) Fusilli/Rotini noodles","25 g (1/4 cup) shredded Emmental/Swiss cheese","Parmesan cheese for serving","Black pepper"],"steps":["Heat oven to 210° C (410° F). Use a knife to remove the cauliflower florets from the stem. Then cut each floret into 3 or 4 smaller pieces.  Toss the cauliflower pieces in a large bowl with 3 Tbsp olive oil, 1 tsp salt, and red pepper flakes. ","Spread cauliflower onto a foil-lined sheet pan. You will place the bell pepper on the pan as well, so leave a space for it. Coat the bell pepper in oil and then place it on the pan. Put pan in oven and roast for 60 minutes. Stir and flip the cauliflower and pepper every 20 minutes during the cooking period. ","For the sauce, heat a medium saucepan over medium-high heat. When hot, add the butter. Add the onion and 1/4 tsp salt and cook for 6-7 minutes, stirring occasionally. Then add the garlic and dill and cook for 1 minute, stirring constantly.","Decrease heat to medium and add the tomato puree, mustard, and 1 Tbsp olive oil. Cook for 5 minutes, stirring occasionally.","Decrease heat to medium-low and add the cream and cheese. Cook for 10 minutes, stirring frequently. When finished, keep the sauce warm by decreasing the stove heat to the lowest setting.","For the pasta, add about 4 liters (4 quarts) water and 1 Tbsp salt to a large pot and bring to a boil. Cook the pasta until al dente, about 10 minutes. Drain and reserve about 30 mL (2 Tbsp) of the pasta water. Return the pasta to the drained pot and add 1 Tbsp olive oil, the reserved pasta water, and 1/2 tsp salt. Stir and set aside.","When the cauliflower and bell pepper have finished cooking, carefully use a knife to remove the stem, seeds, and skin from the bell pepper. Be careful, it will be extremely hot! Dice the pepper and stir into the tomato sauce. ","To assemble, distribute the pasta onto four plates. Spoon a generous amount of the sauce onto the pasta. Arrange the roasted cauliflower on top of the sauce. Top with Parmesan cheese and freshly ground black pepper. Serve immediately. "],"images":["https://i.ibb.co/PC35rDG/cauli-mustard-pasta.jpg","https://i.ibb.co/XW93Xs7/cauli-mustard-pasta2.jpg"],"is_published":true,"publish_date":"2020-08-19T09:12:34.158Z","created":"2020-10-27T01:12:19.302Z","ratings":[],"title":"Roasted Cauliflower with Creamy Mustard and Tomato Sauce","size":"4","intro":"Meet the mustards. When reading about cauliflower on the www, I found out that the vegetable is part of a family of plants called the mustards! Technically the family is named Brassicaceae, but who knows how to pronounce that one? So cauliflower and the plants that yield the seeds used to make Grey Poupon Dijon and French’s 100% Yellow go to the same family reunions. \n\nSo this recipe has cauliflower and mustard. Raw cauliflower dipped in ranch on a veggie tray and hot, roasted cauliflower with charred tips are two completely different experiences. I would pick the latter any day.  \n\nRoasted cauliflower florets are the premier performers in this dish, but we make room for a red bell pepper at the roasting party. The pepper eventually ends up in the sauce. If you prefer to roast the pepper over an open flame or in some other way apart from the cauliflower, go ahead. In this recipe it all happens on the same pan in the same oven, but that’s more out of convenience.\n\nWhen developing this recipe I increased the amount of mustard in the dish until the flavor was just noticeable without being overpowering. Brown mustard is used for its spiciness. Depending on your love for mustard, feel free to experiment with both the kind and amount of mustard you add.\n\nLastly, try to assemble and serve this dish as close as possible to the time the cauliflower comes out of the oven. Enjoy!","quote":"Meet the mustards.","description":"Cauliflower and mustard seeds are from the same family, did you know? Both are featured in this dish that combines spiciness from red pepper flakes and brown mustard, creaminess from a cream-based sauce, and sweetness from roasted cauliflower florets and red bell pepper.","keywords":"vegetarian, mustard, sauce, cauliflower","prep_time":20,"cook_time":60,"category":"dinner","cook_method":"roast, fry, boil","cuisine":"american","__v":0,"newsletter":false}
{"_id":"5f269663ee77e70008bd6104","_type": "recipe", "ingredients":["4 - 5 endives, wilted leaves removed","70 g (5 Tbsp) butter","500 mL (2 cups) milk","30 g (1/4 cup) flour","4 - 5 slices ham","70 g ( 1/2 cup) shredded Emmental or Swiss cheese","1/2 tsp salt","1/4 tsp black pepper","1/4 tsp freshly grated nutmeg"],"steps":["Preheat the oven to 250° C (475° F). Butter a medium gratin or casserole dish. ","Heat a large skillet over medium-high heat. Once hot, melt 30 g (2 Tbsp) of butter. Add the endives and cook until soft and easily pierced with a knife. This takes 15-20 minutes, depending on the size of the endives. I usually take a lid that is smaller in diameter than the skillet and place it on top of the endives while they are cooking. Flip the endives occasionally, you want them to caramelize, but not burn.","For the bechamel sauce, heat a medium saucepan over medium-low heat. Add 30 g (2 Tbsp) of butter and cook until melted. Then add the flour and stir/whisk constantly for 2 minutes. Keep moving to prevent burning. \n","Temporarily remove the saucepan from heat and pour in the milk, whisking non-stop as you do so. Keep whisking until everything is combined. Return the pan to the stovetop and increase the heat to medium. Cook for 12-14 minutes until the sauce has thickened. Stir frequently.\n","Remove the saucepan from heat and add 1/2 tsp salt, black pepper, nutmeg, and 35 g (1/4 cup) of the cheese. Stir until the cheese has melted and the sauce is well-mixed.","Salt the endives to taste. To assemble, roll each endive in a slice of ham. Place the rolled endives into the buttered gratin or casserole dish. Pour the bechamel sauce over the endives. Top with the remaining 35 g (1/4 cup) cheese and the remaining butter, divided into small cubes. ","Bake in the preheated oven for 18-20 minutes, or until the top is beginning to brown. Serve immediately."],"images":["https://i.ibb.co/Y3Dr3ry/endive-bechamel.jpg","https://i.ibb.co/GMh1rnp/endive-bechamel2.jpg"],"is_published":true,"publish_date":"2020-10-27T14:13:31.855Z","created":"2020-10-27T01:12:19.302Z","ratings":[],"title":"Braised Endive and Ham Gratin","size":"4","intro":"If you lived on the North Sea coast of Belgium, you could get into your Volkswagen Golf and drive to the furthest point of the opposite end of the country in less than three hours. Along that short cross-country drive, you would be tempted by a plethora of opportunities to indulge in some quality food and drink: twice-fried, thick-cut fries with mayonnaise as a dipping sauce, beef stew marinated in dark ale, a bucket of freshly steamed mussels, deep-fried frikandel sausages, lightly glazed waffles with embedded sugar crystals, and Trappist ales made in monasteries under the close supervision of monks. Somewhere along the route you would also probably come across today’s featured dish: braised endive with ham and cheese, or “witloof met hesp en kaas” in Dutch.\n\nThe first time I tried endives was at a dinner party in France. For an appetizer, the host put out raw endive leaves along with various dips and sauces. Expecting a lettuce-like taste, I took a leaf, dipped it in a sauce, and took a big bite. Woah. Uncooked, endives are bitter! I enjoyed the flavor, but was quite surprised at the sharp flavor from such a light leaf. Before you begin, I double-dog dare you to eat an entire endive leaf. \n\nA couple years later while living in Belgium, I discovered that the endive is a key ingredient in a traditional Belgian dish. I’ve developed this recipe based on what I observed and tasted in Belgium. To begin the dish, several endives are pan-fried in butter until the outer leaves are caramelized and the endive itself is nearly fork tender. The cooking length depends on what you prefer. If you want a firmer texture with a present bitter flavor, cut down the cooking time and stop once the outer leaves are just caramelized. I choose to cook the endives until they are practically completely tender. Again, it’s up to you.\n\nIf you’ve never made a béchamel sauce before, don’t worry. Think of a white gravy that might be served with biscuits, and you’re practically thinking about a béchamel sauce. First, equal weights of butter and flour are cooked together to form what is known in the culinary world as a roux. Then, milk is stirred into the roux and is heated until the sauce is thickened. At this point, you have a basic béchamel sauce. Start making the sauce and adding it to other basic recipes and you’ll be the talk of the town, you fancy chef. For this recipe, you’ll add a few more ingredients to the sauce to enhance the flavor and to make it cheesy.\n\nSo you’ll have your caramelized endives, your rich béchamel sauce, and some ham slices. Time to bring the whole family together. Each endive gets wrapped up in a ham blanket. The endive-ham rolls are then placed in a baking dish, which is then doused with that fancy sauce you made. The whole thing gets tossed into the oven and remains there until the top begins to brown. At that point, it’s dinner time. Grab a loaf of bread, plate those creamy, ham-wrapped endives, and dig in.","quote":"If you have never tried an endive...","description":"Eaten raw, endive leaves are bitter and sharp and can add a kick to any salad. Cooked, those same leaves become sweet and extremely palatable. Inspired by Belgian cuisine, this dish takes caramelized endives, wraps them in savory slices of ham, and bakes them in a rich, cheesy béchamel sauce that browns perfectly in the oven.","keywords":"Endive, belgian cuisine, ham, gratin, bechamel","prep_time":10,"cook_time":55,"category":"Dinner","cook_method":"Braise, pan-fry, bake","cuisine":"Belgian","__v":0,"newsletter":false}
{"_id":"5f2c253dafa11200081d89fb","_type": "recipe", "ingredients":["2 eggs","1 Boule, Baguette, or other crusty bread loaf","1 garlic clove, peeled","60 mL (1/4 cup) olive oil","15 mL (1 Tbsp) lemon juice","15 mL (1 Tbsp) red wine vinegar","1/2 tsp salt","1/4 tsp black pepper","2 large beefsteak or heirloom tomatoes, sliced into 6mm (1/4 in rounds)","1 large green bell pepper, thinly sliced","3 artichoke hearts, thinly sliced","Handful of fresh fava beans","30 g (1 oz) anchovies (preferably stored in oil)","10 black olives","2 green onions, thinly sliced","12 large basil leaves"],"steps":["Place eggs in a small saucepan and cover with cool water. Heat over high heat. As soon as the water comes to a boil, remove from heat, cover, and let sit for 8 minutes. ","After 8 minutes, transfer eggs to an ice-water bath. Allow to cool several minutes. Peel and slice crosswise into 6 mm (1/4 in) rounds.","Cut the bread in half lengthwise. Cut the garlic clove in half. Rub the inside of the bread with the garlic. Lay the bread halves on a cutting board with the inside face up.","Shake or stir together the olive oil, lemon juice, red wine vinegar, salt, and pepper. Pour the dressing evenly over the bread.","The order in which you assemble the sandwich is up to you. The sandwich pictured was layered in this order: tomatoes, bell pepper, anchovies, artichokes, fava beans, green onion, olives, eggs, and basil leaves. It will feel a bit precarious, especially if you are using an elongated loaf.","Top the sandwich with the upper bread half. Use butcher paper to tightly wrap the sandwich. Keep it tight using a kitchen towel or rubber bands. Let the sandwich sit at room temperature for an hour before serving."],"images":["https://i.ibb.co/9Gd7br3/bagnat1.jpg","https://i.ibb.co/Swq6tBr/bagnat2.jpg","https://i.ibb.co/gzNcPvz/bagnat4.jpg","https://i.ibb.co/jMTT4Y5/bagnat3.jpg"],"is_published":true,"publish_date":"2020-08-24T08:31:18.719Z","created":"2020-10-27T01:12:19.302Z","ratings":[5],"title":"Pan Bagnat","size":"2","intro":"Working a little language translation magic, we find out that the French title “pan bagnat” is “bathed bread” in English. This is a meal from the south of France, one you can imagine yourself enjoying on a sunny day on the Mediterranean coast with a crisp rosé at your side.\n\nThe pan bagnat was initially a budget-friendly sandwich eaten by poor French people in the 19th century. It was made with old bread, some water to soften that old bread, and a few vegetables from the season. Sometimes, if wages were high and market prices were low, anchovies were purchased and added to the sandwich. At some point a bourgeois version came about that swapped the anchovies with tuna and added a nice drizzle of olive oil to the bread. These days the divide between the “poor” and “rich” versions has disappeared, and most variations are based on preference.\n\nIf you happen to be an expert in southern French cuisine you’ll immediately notice from the photo of this recipe that I’ve used the wrong bread. You’ve caught me, I’m a fake, and I apologize. The real deal is made with a round loaf of bread called “pain de campagne.” Find a round loaf if you want the whole experience to be a bit more authentic, but the sandwich will be no less incredible if you use a baguette as is pictured on this page.\n\nThere is no standard as to how long the sandwich needs to sit before eating. I’ve seen recipes (usually in French cookbooks and blogs) that suggest eating immediately, and I’ve seen other recipes that suggest waiting an entire 24 hours before digging in. I leave the sandwich for one hour at room temperature and find it to be long enough for the bread to soften from the dressing, but not so long that the crispness of the vegetables disappears.\n\nIf you are anti-anchovies, use anchovies. Maybe this sandwich will grant you the acquired taste. They’re extremely salty and quite pungent, but there are so many ingredients piled into the bread that the flavors balance out and the anchovy power is reduced. If you are really, seriously anti-anchovies, use tuna.\n\nI’m excited for you to try this one out. Some vegetables might fall out as you take a bite and the tomato juice might drip down your arm, but it’s totally worth it. And remember, no mayonnaise on this one.","quote":"Stay away, mayonnaise.","description":"Two hundred years ago, the poor person’s pan bagnat had anchovies and water, while the rich used tuna and olive oil. Now it’s mostly based on which ingredients you prefer. To make the sandwich, you essentially build a summer salad on a French loaf of bread and then wrap and compress it for an hour or so. Try it.","keywords":"Sandwich, vegetables, eggs, anchovies, spring, summer","prep_time":20,"cook_time":70,"category":"lunch","cook_method":"Boil, marinate","cuisine":"french","__v":0,"newsletter":false}
{"_id":"5f2d17ba8abf980008439ed0","_type": "recipe", "ingredients":["250 g (8 oz) ricotta cheese","1/4 tsp salt","15 mL (1 Tbsp) olive oil","6 g (1/4 cup) fresh basil, finely chopped","220 g (8oz) sun-dried tomatoes","Two 230 g (8 oz) sheets of puff pastry","1 egg yolk","1/2 tsp black sesame seeds"],"steps":["Preheat oven to 190° C (375° F). Position rack in the middle of the oven.","In a small bowl, combine the ricotta, salt, olive oil, and basil. Stir until combined.","Use a small food processor or an immersion blender and small bowl to puree the sun-dried tomatoes. You want a paste that will be spread over the cheese mixture.","Roll and cut each pastry sheet into a circle with a 33 cm (13 in) diameter. Line a baking sheet with parchment paper and place one of the pastry circles on the paper.","Spread the cheese mixture onto the pastry round, leaving a 2.5 cm (1 in) gap around the perimeter. Spread the sun-dried tomato paste on top of the cheese mixture.","Use your fingers or a pastry brush to moisten the perimeter of the dough with water. Lay the second pastry sheet on top of the first. Use a fork to seal the perimeter. ","Place an 8 cm (3 in) diameter jar lid on the center of the tarte. This is just to mark where the knife will not cut. Now use a knife to cut 16 even rays around the lid; the tarte will look like a sun. Carefully twist each ray a full 360° turn.","Whisk together the egg yolk and 1 tsp water. Remove the lid from the center of the tarte, and use a pastry brush to brush all the exposed pastry dough. Sprinkle the sesame seeds over the center portion. Bake in the oven for 30-35 minutes, until the pastry dough is light brown and flaky. ","Let the tarte cool and serve warm or at room temperature."],"images":["https://i.ibb.co/9ghzrhb/tarte-soleil.jpg","https://i.ibb.co/64KP4nz/tarte-soleil2.jpg"],"is_published":true,"publish_date":"2020-08-29T07:01:33.754Z","created":"2020-10-27T01:12:19.302Z","ratings":[5,4.5,5],"title":"Tarte Soleil","size":"3-4","intro":"The day may come when you decide to make a tarte soleil (translated to “sun tart”) not because you are hungry, not because you need a killer appetizer for a dinner party, but because you want to see something that looks so incredibly beautiful come out of your oven. If made for viewing-only purposes, this tarte should last uncovered on your countertop for several weeks. \n\nFor a successful tarte soleil, your geometric skills need to be top notch. The pattern of rays extending from the middle will be beautiful when the pattern of rays extending from the middle is consistent. Remember that. I normally go with 16 rays, but the choice is up to you. However many you choose, be gentle when making the 360 degrees twist, and keep the corkscrew section closer to the middle. Leave the end of each ray wide and flat or the ray will end up a bit spindly and weird.\n\nYou may find that the rim of the baking sheet gets in the way when trying to cut the rays. If this worries you, just layer a couple sheets of parchment paper on top of a large cutting board, prepare the tarte on the paper, cut the rays, and then transfer the entire thing to the baking sheet. I say a couple sheets of parchment paper because I often cut through the first paper layer when cutting, which makes the transfer nearly impossible. Having that extra layer of paper should ensure you have a solid base to make the transfer.\n\nThe super duper thing about everything is that you can play with several variations on a theme when choosing ingredients. I’ve suggested my favorite combination - ricotta, sun-dried tomatoes, basil - but I’ve also enjoyed other combos like goat cheese and bacon or pesto and parmesan. Just recently I came across a recipe for a churro-like tarte soleil. Mmhmm.\n\nDon’t stress out too much about this one. Have fun with it and it will turn out great. Treat it more like a 3rd grade art project than a cooking project. Remember those glory days? The dough is your playdough, the egg yolk your toxic-free paint, and the sesame seeds your...sprinkles.","quote":"An edible geometric sun.","description":"Behold the sun tart. A simple geometric pattern, some outstanding 360 degrees twists, and a light egg-yolk coating turn this dish into an eye-pleasing work of art. Filled with slightly-sweet, slightly-tangy sun-dried tomatoes and a generous layer of ricotta cheese, this tarte assumes the appetizer role with extreme confidence.","keywords":"Pastry dough, food art, french, appetizer","prep_time":15,"cook_time":35,"category":"appetizer","cook_method":"bake","cuisine":"french","__v":0,"newsletter":false}
{"_id":"5f2feb0a50af310008274b0d","_type": "recipe", "ingredients":["1 kg (2 lbs) tomatoes, cored and chopped","1 small shallot, minced","1 Tbsp freshly grated ginger","100 g (1/2 cup) light brown sugar","1 cinnamon stick","3/4 tsp salt","1/4 tsp red pepper flakes","1/4 tsp black pepper","25 mL (1.5 Tbsp) fresh lime juice"],"steps":["Combine all the ingredients EXCEPT 1 Tbsp of the lime juice (we will add this later) into a large pot, and heat over medium-high heat until boiling. ","Once boiling, lower the heat to low or medium-low to maintain a simmer. Simmer for 30 minutes and then remove the cinnamon stick. Continue to simmer for another 1.5 hours (for a grand total of 2 hours). Stir occasionally.  During the last 10 or so minutes of cooking, stir in the remaining 1 Tbsp of lime juice.","Remove the jam from heat once you can push your spoon across the bottom of the pan and a clear path remains. The texture of the jam will have left the runny phase and will seem fairly gelatinous. It will continue to firm up as it cools.","Cool the jam and store covered in the fridge."],"images":["https://i.ibb.co/G27nP7X/tomato-jam2.jpg","https://i.ibb.co/Kyq5s3c/tomato-jam.jpg"],"is_published":true,"publish_date":"2020-11-10T07:01:51.602Z","created":"2020-11-10T03:14:32.988Z","ratings":[5],"title":"Tomato Jam","size":"About 500 g (2 cups)","intro":"When it comes to tomatoes, better late than never is what I say. I am currently looking out my window as I write, and I see a few solid icicles clinging to the gutter and a good six or so inches of snow on the ground. The Rocky Mountain tomato season is over. If you live in the neighborhood of California or Texas however, you might still be able to snag a few red globes from the garden. Wherever you are, if you can get your hands on some tasty tomatoes, give this recipe a try. If not, put it in your back pocket for next summer and let the excitement build.\n\nThere’s a sweet science to jam-making. As I don’t comprehend the nitty-gritty details enough to explain it to myself, I’m not even going to attempt to explain it here on the public world wide web. That would be embarrassing. What I do know is that the process involves enzymes, heat, polymer chains, pectin (which a tomato has a lot of), sugar, and acid. There. That’s as much as I’m going to say regarding the science of making jam. Take a five-minute coffee break to do a bit of googling and read about how it all works.\n\nLike several other recipes on the site, this one is going to ask for some patience and a bit of babysitting. Show your tomato jam some true love. Think about your favorite childhood toy. Maybe it was a Beanie Baby stuffed animal. Maybe it was a Beanie Baby stuffed animal dog. Maybe it was a Beanie Baby stuffed animal dog named Bones. Think about how much you loved Bones and how he was your best friend. That’s the kind of love and patience this jam deserves. It’ll be worth it.\n\nI’ll say a few things about the flavors I chose to include in the jam. Let’s start with the red pepper flakes. Sometimes I can’t stop myself from sprinkling a pinch of red pepper flakes into a dish. It just feels right, and adding a minor quantity of the flakes often greatly enhances flavors while not actually turning the dish to the spicy-side. That’s what happens with this jam. The heat from the flakes creates an energy in the jam while not classifying the sweet tomato gel as spicy.\n\nInstead of including an onion, I decided to feature a shallot. Shallots can often be a bit sweeter than onions, and are usually less powerful when cooked. I didn’t want an onion flavor to compete with the tomatoes, and I liked the idea of using the shallot’s natural sweetness. As soon as I decided to use a shallot, I immediately thought of how much I love combining shallots with ginger. So ginger was invited to the jam session and ended up becoming a permanent guest.\n\nThe acid for the jam comes from a lime. A fresh lime, mind you. That stuff that comes in the green plastic bottle might make your jam taste a little funky. The risk is up to you though, and you have every right to do things your own way. I’m just saying, fresh limes raise the roof. Fresh lemon juice could also be used, but I like the pairing of lime with the shallot and ginger flavors.\n\nLastly, I’ll say a thing or two about the cinnamon stick. There is a reason I chose a cinnamon stick over ground cinnamon. The cinnamon stick is added at the beginning of the recipe. Relatively soon after the cooking has begun, the stick is removed. This gives you the flexibility of tasting and removing the cinnamon stick once you feel like the cinnamon flavor is at the level you want. I removed the stick after 30 minutes of cooking, but you may decide you want a less present cinnamon flavor and remove it earlier. Your call, and that’s the story of why I went with a cinnamon stick.\n\nRemember this: the jam will firm up as it cools. Obtaining the perfect jam consistency depends on the ingredient ratios, the intensity of the cooking heat, and how long you keep the pot on the flame. If this is your very first time making jam, don’t be discouraged if it doesn’t turn out like you envisioned. Try again. Mix up the method. Try other recipes. You’ll get it. \n\nWhen the jam is cooled and ready to eat, I have a suggestion. In the picture on this page you can see two blurry sandwiches behind the bowl of jam. Those particular sandwiches had crisp bacon, sliced tomatoes, plain cream cheese, and the tomato jam. A real winner in my book. Try it and enjoy.","quote":"A tomato, a shallot, and some ginger had a jam session.","description":"The science of making jam is rad. Combine the right amounts of sugar, heat, pectin, acid, and fruit, and you’ll end up with a top-notch spread for your next slice of toast. Taking advantage of the naturally occurring pectin found in tomatoes, this recipe combines shallots, ginger, cinnamon, and red pepper flakes to produce an energetic tomato jam that makes a stellar bacon and tomato sandwich.","keywords":"Jam, tomatoes, preserving, slow cooking, tomato jam","prep_time":15,"cook_time":120,"category":"Appetizer, condiment","cook_method":"Boil, simmer","cuisine":"American","__v":0,"newsletter":false}
{"_id":"5f3cde667057120008bb14a5","_type": "recipe", "ingredients":["1 red bell pepper, thinly sliced","1 yellow bell pepper, thinly sliced","1 large yellow onion, thinly sliced","One 800 g (28 oz) can crushed tomatoes","2 medium tomatoes, cored, seeded, and thinly sliced","4 garlic cloves, minced or pressed","30 g (1/2 cup) fresh parsley, chopped","100 g (3.5 oz) feta cheese","1 tsp salt ","45 mL (3 Tbsp) olive oil","1 tsp cumin","1 tsp paprika","1 tsp ground coriander","1/4 tsp red pepper flakes","6 eggs","Freshly ground black pepper"],"steps":["Heat a large oven-proof skillet over medium-high heat. Once hot, add 1 Tbsp oil. Add the onions and 1/4 tsp salt and cook for 5 minutes, stirring frequently.","Add another 1 Tbsp olive oil, 1/4 tsp salt, and the bell peppers and cook for 15 minutes, stirring occassionally. At this point, preheat the oven to 200° C (390° F).","Add the garlic, cumin, paprika, coriander, and red pepper flakes and cook for an additional 30 seconds, stirring constantly.","Decrease heat to medium-low and add the tomato slices, 1/2 tsp salt, 1 Tbsp oil, and crushed tomatoes. Cook for 15 minutes, stirring frequently.","Remove from heat and use a spoon to make six indentations in the shakshouka around the perimeter of the pan. Crack one egg into each indentation. If an egg starts to run out of its indentation, use the spoon to build a \"wall\" around the egg from the surrounding tomato mixture.","Carefully transfer the skillet to the oven and bake for 8-10 minutes. The egg white should be barely set and the yolks should still be very runny.","Top with crumbled feta, parsley, and a few grinds of black pepper. Serve hot with crusty bread."],"images":["https://i.ibb.co/NFmcdzB/shakshouka.jpg","https://i.ibb.co/V3WgtKM/shakshouka2.jpg","https://i.ibb.co/y8f94mk/shakshouka3.jpg"],"is_published":true,"publish_date":"2020-09-01T17:20:40.374Z","created":"2020-10-27T01:12:19.302Z","ratings":[5],"newsletter":false,"title":"Shakshouka","size":"3-4","intro":"A few years ago I was on a search for camping meals that don’t involve Top Ramen, canned bean and bacon soup, or pouches of dehydrated sludge. My friend and I perused the web and came up with a list of novel ideas to break up the Friday night camp stove monotony. One recipe, with an unfamiliar title, stole the show. Shakshouka. While not feasible as a backpacking meal, this dish has become a favorite in both the kitchen and at the car-camping picnic table. Sidenote: modifications are necessary if you recipe to make this while camping.\n\nApparently, like so many other dishes, no one reallllly knows where shakshouka originated. Turkey? Morocco? Yemen? Good question. Wherever it’s actually from, shakshouka remains popular in North Africa and the Middle East. \n\nIn a nutshell, shakshouka is composed of stewed, spiced vegetables, (usually) tomatoes, (sometimes) minced meat, and various other toppings depending on who’s running the show in the kitchen. Well, I’m running the show today, and we’ll be topping our shakshouka with feta, fresh parsley, and some freshly ground black pepper.\n\nYou can see I’ve prepared the dish in a cast-iron skillet. Acidic ingredients, like tomatoes, react with the iron and can ruin the seasoning of your skillet and cause your food to taste metallic. If your skillet is well-seasoned, the cooking time is short enough so that there shouldn’t be a problem. Just be sure to transfer all the contents of the pan to serving bowls or tupperware soon after everything is finished cooking. If your skillet is relatively new, unused, or recently reseasoned, go with a stainless-steel or enamel-coated pan.\n\nI add a couple sliced fresh tomatoes to complement the large amount of canned tomatoes. And notice I’ve used the word sliced. My favorite way to prepare this dish is to slice the bell peppers, the onion, and the fresh tomatoes. No worries if you prefer to dice the vegetables, but I think the sliced version gives the stew a heartier texture.\n\nWhen it’s time to serve, provide either crusty bread or pitas so everyone can sop up the remaining tomato sauce at the end of the meal.","quote":"Say ‘shakshouka’ ten times as fast as you can.","description":"Everyone will adore you when you make shakshouka in the kitchen, but throw it together on a camp stove during your next car camping trip and you’ll be the real star. A spiced bowl of stewed tomatoes, bell peppers, and onions, topped with feta, eggs, and parsley, results in a feel-good sort of meal to write home about.","keywords":"Stew, eggs, feta, spices, poach","prep_time":15,"cook_time":45,"category":"Lunch, Dinner","cook_method":"Fry, bake, poach","cuisine":"North African, Middle Eastern","__v":0}
{"_id":"5f3cde957057120008bb14a6","_type": "recipe", "ingredients":["2 medium eggplants","45 mL (3 Tbsp) olive oil","1 large yellow onion, thinly sliced","3/4 tsp salt","1 large tomato, seeded, cored, and coarsely chopped","2 Tbsp minced parsley","2 garlic cloves, minced or pressed","30 mL (2 Tbsp) fresh lemon juice"],"steps":["Preheat the oven to 200° C (400° F). Line a sheet pan with foil.","Cut the eggplants in half lengthwise. Position eggplant halves face-up on foil-lined pan. Brush the face-up surface of each eggplant half with olive oil, using 1 tsp oil per eggplant half. Brush quickly, as the eggplant will soak up the oil immediately. Bake in the oven for 50 minutes, flipping the eggplant halves after 25 minutes.","Heat a medium skillet over medium-high heat. Once hot, add 1 Tbsp olive oil. Add the onion and 1/2 tsp salt and cook for 6-7 minutes, stirring frequently.","Decrease the heat to low and cook for another 20 minutes, stirring every few minutes to avoid burning. You should end up with about 60 g (1/3 cup) caramelized onions. Transfer onion to a plate or bowl and reserve for later.","Wipe out the medium skillet and return to the stove over medium heat. Fry the tomatoes for 3-4 minutes until they begin to soften. Remove from heat and set to the side.","Remove eggplant halves from the oven. Place a colander over a bowl. Once cool enough to handle, scrape the eggplant flesh into the colander and let sit for about 5 minutes. Discard the eggplant skins. You do not need to reserve the strained liquid.","Combine the drained eggplant, tomato, caramelized onion, lemon juice, parsley, garlic, and 1/4 tsp salt in a small bowl or small food processor. Use an immersion blender or food processor to briefly puree the ingredients.","Serve warm or at room temperature."],"images":["https://i.ibb.co/t3694q1/eggplant-dip.jpg"],"is_published":true,"publish_date":"2020-10-19T08:11:20.424Z","created":"2020-10-27T01:12:19.302Z","ratings":[4.5,5],"newsletter":false,"title":"Roasted Eggplant and Caramelized Onion Dip","size":"4","intro":"oiu","quote":"What happens if you don't invite tahini?","description":"This dip combines the smoky flavor of slow-roasted eggplants, the sweetness of caramelized onions and a fried tomato, the tanginess of a lemon, and the spiciness and brightness of garlic and parsley. Get those pitas ready.","keywords":"Eggplant, dip, caramelized onion, mediterranean","prep_time":10,"cook_time":60,"category":"Appetizer","cook_method":"Roast, fry","cuisine":"Mediterranean","__v":0}
{"_id":"5f3cdee97057120008bb14a8","_type": "recipe", "ingredients":["4 eggs","300 g (10 oz) grape tomatoes","1 small shallot, thinly sliced","8 red radishes, thinly sliced","1 yellow bell pepper, seeded and sliced","100 g (3.5 oz) black Nicoise or Kalamata olives","One 140 g (5 oz) can of tuna","15 mL (1 Tbsp) freshly squeezed lemon juice","60 mL (1/4 cup) olive oil","15 mL (1 Tbsp) red wine vinegar","Several sprigs of fresh parsley"],"steps":["Cut the grape tomatoes into halves and place in a colander. Place colander over a bowl and add 1/2 tsp salt to the tomatoes.","Fill a small bowl with ice water and add the shallots.  Allow the shallots to soak and the tomatoes to drain for about 20 minutes while you continue preparing the salad. After 20 minutes, drain the shallots.","Place eggs in a small pot and cover with cold water. Bring the water to a boil on the stove. Once boiling, remove pot from heat and cover. Let sit covered for 8 minutes. Then transfer eggs to a bowl of ice water and let sit for 5 minutes, or until cool enough to handle. Peel the eggs and slice into rounds.","For the vinaigrette, combine the lemon juice, olive oil, red wine vinegar, and drained tomato juice in a small bowl or jar. Whisk or shake until combined.","Assemble salad by layering bell pepper, radish slices, tuna, olives, tomatoes, shallots, egg slices, and parsley leaves. Dress with the vinaigrette."],"images":["https://i.ibb.co/C2CRZbW/salade-nicoise1.jpg"],"is_published":true,"publish_date":"2021-01-19T18:10:24.116Z","created":"2021-01-19T15:57:10.307Z","ratings":[],"newsletter":false,"title":"Salade Nicoise","size":"4","intro":"I live near a section of the Rocky Mountains. Normally at this time of year, the foothills are blanketed in layers of snow, the backyard is a permanent sledding hill, and the sidewalks are narrow ice skating rinks. This year, however, we find ourselves spending sunny afternoons outside in t-shirts, later coming inside and reaching for a drink from the fridge instead of setting the kettle on the stove. It’s weird. \n\nAs a result of this otherworldly weather, I’ve decided to publish a recipe I was originally going to save for spring or summer: salade niçoise. Nice, France sits along the coast of the Mediterrannean Sea. When in Nice, you are zero minutes away from the beach, one hour and four minutes away from an Alpine ski resort, and a five-hour ferry ride away from the stunning island of Corsica. There are many places in the world I have yet to see, but so far it’s hands down one of my favorite regions on this planet.\n\nIf you browse Peel the Garlic and scroll back to some of my first recipes, you’ll find other dishes from the region: pissaladière, tarte soleil, and pan bagnat. Take a look at these recipes and you’ll notice several recurring ingredients: olive oil, tomatoes, eggs, olives, etc. Vinaigrette dressings and an abundance of fresh, summer vegetables are staples of the cuisine found in southern France.\n\nIt’s January, so obviously it is not prime time for buying tomatoes and bell peppers, but it is prime time for planning what to grow in your garden this year. Stockpile some radish, grape tomato, parsley, and bell pepper seeds, and you’ll be well on your way to making the freshest (and first?) salade niçoise you’ve ever tried. \n\nThe version of salade niçoise you are about to make includes shallots instead of another type of onion. Regardless of which member of the onion tribe you use, I highly suggest you deflame the raw onion. Woah, deflame? When you deflame an onion, you soak the raw, cut onion pieces in cold water for 10 to 20 minutes and then drain and rinse. This process removes the sulfurous compounds responsible for strong, onion breath and crying eyes caused by onions. In this recipe I instruct you to deflame the shallots for 20 minutes. Doing so will give you a pleasant shallot flavor in every bite without requiring you to gargle with mouthwash after the meal.\n\nYou’ll notice that the first thing you are asked to do in the recipe is to cut the tomatoes in half, add some salt, and allow the tomatoes to drain in a colander. When the salt comes in contact with the cut tomatoes, it simply does its thing and extracts the liquid from the tomatoes, dropping it into the bowl beneath the colander. After 20 minutes or so, you will have a small accumulation of tomato liquid in the bowl. You will add this tomato juice to the basic vinaigrette, transforming a humdrum mixture into a garden fresh dressing.\n\nSalade Niçoise is a staple of southern French cuisine. You’ll find variations of the traditional dish all over the internet. The good news is that you are making the salad, so you get to choose what to add. Have some carrots on hand and want to throw them in? Do it. Don’t eat tuna fish? Take it out. \n\nWherever you are, have a nice time pretending it’s spring by making (or planning) this garden fresh salad in the dead of winter.","quote":"It’s been a warm winter - have a salad.","description":"We could use a bit more snow this winter, but might as well pretend it’s spring while the air is warm. Salade Niçoise hails from the Mediterranean coast of France. Find a sunny day to assemble this salad made up of tuna fish, fresh vegetables, and a tomato-infused vinaigrette.","keywords":"Southern France, Nice, Salad, French food, Salade Nicoise","prep_time":35,"cook_time":15,"category":"Lunch","cook_method":"Boil, Slice and dice","cuisine":"French, Mediterranean","__v":0}
{"_id":"5f3cdf137057120008bb14a9","_type": "recipe", "ingredients":["2 large tomatoes","1/2 tsp salt","250 g (8 oz) crusty loaf of day-old bread","1/2 red onion, sliced very thin","1/2 cucumber, sliced and lightly salted","60 mL (1/4 cup) olive oil","30 mL (2 Tbsp) red wine vinegar","6 g (1/4 cup) fresh basil leaves","50 g (2 oz) feta cheese, crumbled","1/2 tsp coarse sea salt","Freshly ground black pepper"],"steps":["Cut tomatoes into about eight 2.5 cm (1 in) pieces. Place in a colander and set the colander over a bowl to catch the juice. Add 1/2 tsp salt and a drizzle of olive oil to the tomatoes and let sit for 15 minutes.","Meanwhile, soak the onion slices in a bowl of cold water for 10 minutes. Then drain.","Pour the olive oil and red wine vinegar over the tomatoes and let drain for another 5 minutes. ","Chop the bread loaf into 2.5 cm (1 in) cubes and place in a large bowl. Pour the strained tomato-oil-vinegar liquid over the bread and stir to evenly combine. Let sit for 10 minutes, stirring occasionally to evenly distribute the dressing.","To assemble the salad, divide the bread onto plates. Top with cucumber slices, onion slices, tomatoes, and basil leaves. Sprinkle each plate with feta, a pinch of coarse sea salt, and a pinch of freshly ground black pepper."],"images":["https://i.ibb.co/RgHVkn1/panzanella.jpg","https://i.ibb.co/GpknrPY/panzanella2.jpg"],"is_published":true,"publish_date":"2020-09-22T17:39:28.638Z","created":"2020-10-27T01:12:19.302Z","ratings":[],"newsletter":false,"title":"Panzanella","size":"2","intro":"What are we celebrating today, September 22? Many things. The 26th anniversary of the television premiere of Friends. The 19th year of the Dead Sea Scrolls being available to the public. Opera singer Andrea Bocelli’s 62nd birthday. And last but not least, the last day of summer. \n\nSo before making the transition into fall, gather the remaining rays from the summer sun and funnel that energy into putting together this delectable panzanella. At its core, panzanella is an Italian salad of onion, tomato, and bread. Mix in some basil and cucumber, whisk together a simple vinaigrette, top the whole thing with some feta and fresh black pepper, and you’re ready to properly say, “ciao, until next year” to summer.\n\nNot only does the vinaigrette for this salad have oil and vinegar, it also includes the juice from the tomatoes. The secret to pulling the juice from the tomatoes is salt. Simply sprinkle the cut tomatoes with salt, place them in a colander, and kerplunk! Osmosis magic! The salt draws the liquid from the tomatoes, the liquid drops into the bowl below, and the tomatoes remain nice and cozy in the colander. Adding this juice to the dressing helps permeate the flavor of tomato throughout the salad.\n\nThe bread you use should not be fresh from the bakery. Many panzanella recipes suggest a convenient method for “aging” fresh bread that includes drying out the bread in the oven. I have not tried this method before, but take a moment to look into it if it’s something that interests you. And let me know how it goes if you do it! Normally I buy a small bread boule and let it sit out on the counter for a day or two. The goal is to have bread hard enough that it will stay together after soaking up the dressing, and soft enough that it will actually soak up the dressing. \n\nWhen slicing the onions, the thinner the better. It’s much easier to make thick slices of onion, but you don’t want the onion flavor to completely dominate. You want it to play well with everything else on the plate. For this reason, go thin. Present, but not overpowering. I suggest soaking the onions in cold water. This tempers the strength of the flavor of the raw onions. If raw onions rock your world and you want to taste every ounce of power they offer, skip the water soak.\n\nThe only green leaf in this salad is basil. If you still have some after making last week’s Braised Pork Chops with Peach and Basil recipe (shameless self-promotion), you win! One less ingredient you have to put in your shopping cart. Once you do have all the ingredients, have some fun layering and plating the salad before serving. You, yes you, are a creative, culinary craftsperson.","quote":"Bread, Basil, Battlestar Galactica.","description":"Say it ain’t so -- it’s the last day of summer! Head to the garden (or produce section) and pick those summery vegetables, pluck that day-old loaf of bread off the counter, and get ready to compose a beautiful panzanella. With a little osmosis magic you’ll obtain tomato juice for the vinaigrette that will spread the tomato-flavor-love to every bite.","keywords":"Italian, salad, Tuscan, no heat, summer","prep_time":15,"cook_time":25,"category":"lunch","cook_method":"Marinate","cuisine":"Italian, Tuscan","__v":0}
{"_id":"5f48ffbf4ffb840008476140","_type": "recipe", "ingredients":["*DOUGH","14 g (4.5 tsp) active dry yeast","250 mL (1 cup) lukewarm water, 40°-45° C (105° - 115° F)","1 tsp sugar","480 g (4 cups) all-purpose flour","1.75 tsp salt","45 mL (3 Tbsp) olive oil","*TOPPINGS","60 mL (1/4 cup) olive oil","1 kg yellow onions, thinly sliced","1 tsp dried thyme","1 tsp dried herbes de provence","1 large garlic glove, minced or pressed","60 g (2 oz) anchovies","black pepper","14 black Nicoise or Kalamata olives"],"steps":["*DOUGH","Combine the yeast, sugar, and half of the lukewarm water in a small bowl. Stir until homogeneous and let sit for 5 minutes. In a large bowl combine the flour and 1 tsp salt.","Pour the liquid mixture into the dry ingredients and add 45 mL (3 Tbsp) olive oil and the remaining lukewarm water. Use a wooden spoon to stir together until a ball of dough is formed. Transfer to a floured surface and knead for 10 minutes until the dough is smooth. It will not be very sticky.","Transfer dough to a large oiled bowl, cover with a damp towel, and let rise for 1.5 hours.","*CARAMELIZED ONIONS","Heat a stockpot over medium-high heat. Once hot, add 60 mL (1/4 cup) olive oil. Add the sliced onions and 1/4 tsp salt. Cook for 10 minutes, stirring frequently.","Decrease the heat to low and stir in the thyme and herbes de provence. Cover the pot and cook for 40 minutes, stirring the onions every 5 minutes. Near the end of the 40 minutes, preheat the oven to 220° C (430° F).","Remove the lid and cook the onions for an additional 10 minutes, stirring occasionally. While cooking, mince about 2 anchovies. Add the minced anchovies, the garlic, 1/4 tsp salt, and a few grinds of black pepper during the last 5 minutes of cooking. Remove from heat.","*PISSALADIÈRE","Oil a 23x33 cm (9x13 in) pan. Set the dough in the pan and use your fingers to press the dough out to the edges of the pan. Spread the caramelized onions on top of the dough in an even layer. ","How you place the anchovies and olives is up to you. The version pictured in this recipe an alternating pattern of olives and anchovies, with the anchovies placed in an \"X\" formation. Once topped, bake in the oven for 15-20 minutes, until the crust edge is golden."],"images":["https://i.ibb.co/tDPcs66/pissaladiere.jpg"],"is_published":true,"publish_date":"2020-09-29T17:00:43.891Z","created":"2020-10-27T01:12:19.302Z","ratings":[5],"newsletter":false,"title":"Pissaladière","size":"6-8","intro":"There’s an episode of Spongebob Squarepants where Spongebob and Patrick are talking to a pirate ghost who is making an attempt to scare them. Unphased, Patrick demands the ghost tell him the whereabouts of his pizza order. The ghost waves his hands, says, “Pizza? I’ll give you a pizza!” and magically produces a pizza box. Spongebob and Patrick open the box, look inside, and scream. Why? They find a pizza topped with anchovies.\n\nOther than the Teenage Mutant Ninja Turtles, I feel like the cartoon characters of the 90s taught me that anchovies are the scum of the earth when it comes to pizza toppings. I’ve since learned that anchovies aren’t actually as frightening as I was made to believe. Today I’m going to introduce you to the original anchovy pizza and show you how it’s made.\n\nThe pissaladière was created by the Romans in the region that is now France and Italy. Living on the Mediterranean, one of the cheapest and most commonplace ingredients at the time was anchovy. At some point the little fish ended up on a baked, tart-like flatbread and became a popular dish. I’ve heard people say that pissalidère is the original pizza, but who knows? If you actually know, fill me in. So what is it actually? A shortcrust topped with caramelized onions, anchovies, and strong black olives.\n\nWhile simple in ingredients, pissaladière is not shy when it comes to bold flavors. Just a heads up, this is not for the salt-sensitive. Anchovies are normally cured with salt and packed in a concentrated, salty brine. Additionally, the black Nicoise olives are also cured in salt, adding an extra oomph to the salt punch. With that being said, the base layer on top of the crust is made of caramelized onions, so expect a powerful contrast between the salty and the sweet.\n\nA few tips about making this pissaladière. I encourage you to make the crust. If you decide you need a shortcut, you can always pick up some store-bought tart crust dough and skip the crust-making steps. If you do make the crust yourself (and I hope you do), just remember that the dough will not be sticky. This dough does not yield a tender crumb; the final consistency will be firmer and almost cracker-like.\n\nWhen making the caramelized onions, know that the onions slices will lose their moisture and will greatly reduce in size. It will feel like you have way too many onions when you first slice them and add them to the pot, but just remember that your stockpot becomes a shrink ray when caramelizing onions.\n\nLast thing. Presentation is important. Presentation is always important, but especially when making a pissaladière. You can see in the picture above that I went with an olive&amp;#x2F;anchovies-in-an-X alternating pattern. You could go with an argyle pattern, a radial layout, or even an abstract contemporary design. It’s up to you, just make sure those littles fishes look their best.","quote":"Have you met pizza’s Roman grandfather?","description":"If you’ve never actually tried anchovies, here’s your chance. Some claim this is the original pizza. With a salty punch from the anchovies and olives, and a balancing sweetness from the caramelized onions, Provençal locals say pissaladière is an excellent appetizer to pair with a glass of Pastis.","keywords":"Strong flavor, French, Salty, Appetizer, Pissaladière","prep_time":100,"cook_time":80,"category":"Appetizer","cook_method":"Pan-fry, caramelize, bake","cuisine":"French, Provençal","__v":0}
{"_id":"5f48ffe44ffb840008476141","_type": "recipe", "ingredients":["500 g (1 lb) chuck roast, cut into 2.5 cm (1 in) pieces","300 mL (10 oz) dark ale (Belgian if possible)","3 garlic cloves, peeled and smashed","120 g (1 cup) all-purpose flour","2 tsp salt","1 tsp black pepper","56 g (4 Tbsp) butter","2 yellow onions, diced","240 mL (1 cup) beef broth","100 g (3.5 oz) pearl onions, peeled and kept whole","1 tsp brown mustard","1 Tbsp brown sugar","1 tsp dried thyme","15 mL (1 Tbsp) cider vinegar"],"steps":["Combine the beef, ale, and garlic cloves in a medium bowl. Cover and marinate in the refrigerator for 2.5 hours.","Strain the marinade from the beef, reserving the marinade. Dry the beef pieces with a paper towel. Combine the flour, 1 tsp salt, and 1 tsp black pepper in a medium bowl. Toss a few pieces of beef at a time in the flour, shaking off the excess flour and storing the floured beef on a plate.","Preheat the oven to 140° C (280° F).","Heat an oven-safe dutch oven over high heat. Once hot, melt 2 Tbsp of butter in the pot. Add half of the beef pieces to the pot and sear, flipping as necessary, until a brown crust has formed on all sides. Transfer the beef to a plate. Add the remaining 2 Tbsp of butter and repeat with the remaining pieces of beef. Transfer to the plate of beef when done.","Decrease heat to medium-high, and add the diced onions. Cook for about 5 minutes until soft, stirring frequently.","Return the beef to the pot of onions and add the reserved marinade, beef broth, mustard, sugar, thyme, cider vinegar, and 1 tsp salt. Bring to a simmer and then remove from heat and cover.","Transfer the covered dutch oven to the oven and cook for 2 to 2.5 hours, until the beef is very tender.","Serve with fries and a glass of the brown ale that was used for the dish."],"images":["https://i.ibb.co/dPvZp0C/carbonnade.jpg","https://i.ibb.co/fF6jGS6/carbonnade2.jpg"],"is_published":true,"publish_date":"2020-11-17T13:43:23.762Z","created":"2020-11-17T15:35:56.875Z","ratings":[],"newsletter":false,"title":"Carbonnade Flamande","size":"4","intro":"Christmas lights are going up early this year. The pandemic is ridiculously difficult on everyone, so inviting the annual feel-good season a few weeks early seems like a good idea to me. If it’s in your power to make your home environment a little jollier, do it. With all that said, here’s a comfort-stew that pairs well with the early arrival of the holiday season.\n\nHere’s the thing about this dish: it’s mostly beef. While I personally don’t stick to a vegetarian diet, I normally try to limit my meat consumption to a few times a week. More cows = more greenhouse gases. And that’s bad. Right, why don’t I just cut out meat altogether. Limiting my meat consumption is just a point between completely avoiding meat and not caring at all, and it’s the eating habit I’ve decided to adopt. That’s all. Anyway, what I’m trying to say with all this is  that you shouldn’t make this dish a nightly ritual.\n\nCarbonnade! If you’ve ever had beef bourguignon, it’s extremely similar. Beef bourguignon is a French stew made with beef and wine. Cross the northeast border of France and you’ll find the same dish with one major difference: beer is used instead of wine. For this dish try to find a dark, malty beer. For the authentic experience, pick something Belgian. Chimay, Westmalle, and St. Bernardus are all great options. I used Westmalle Dubbel for the particular version pictured on this page.\n\nI’m not Belgian, so everything I know about this dish comes from the couple years I spent living in Belgium. From what I experienced, carbonnade is a classic comfort meal. I’ve been told it’s one of those recipes that has been passed on from grandma to grandma to grandma. Why grandma is always passing down the recipe and never grandpa is a mystery to me - I’m just telling you what I’ve been told.\n\nHere’s what happens with this dish. First, the beef spends a few hours marinating in the chosen ale before being seared on the stovetop. The onions are then sautéed. Finally, the beef, onions, marinade, and all remaining ingredients are combined into one pot and are cooked in the oven at a low temperature for at least two hours. The beef becomes tender, the collection of flavors meld, and the smell from your kitchen will magically gather every single person in your house into one room.\n\nCarbonnade is normally accompanied by some form of potatoes, with fries being the most common. Belgian fries are fried not once, but twice. So if you don’t feel like attempting to make a batch of Belgian fries, get your hands on some crispy french fries to serve with the stew.\n\nAs they say in Belgium, eet smakelijk (enjoy your meal)!","quote":"Eet smakelijk!","description":"A classic Belgian dish, carbonnade flamande stands out in the world of stews as the beef is marinated in a malty, Belgian-style ale. The meat is slowly cooked and then served with a heaping basket of fries. Make this one for a special occasion as the weather cools and the thought of a hearty stew grows ever more tempting.","keywords":"Belgian food, stew, beef, carbonnade","prep_time":150,"cook_time":150,"category":"Dinner","cook_method":"Marinate, fry, stew, braise","cuisine":"Belgian","__v":0}
{"_id":"5fab49f12a50ab0008999d39","_type": "recipe", "ingredients":["*BROTH:","1.8-2.2 kg (4-5 lb) whole chicken","1 large onion, peeled and quartered","2 celery stalks, coarsely chopped","2 carrots, peeled and coarsely chopped","5 garlic cloves, peeled","1/4 tsp red pepper flakes","4 cloves","3.5 tsp salt","1/2 tsp freshly ground black pepper","6 parsley sprigs","1800-2300 mL (8-10 cups) water","*EGG NOODLES:","240 g (2 cups) flour","1/2 tsp garlic salt","1/2 tsp salt, and 1 Tbsp salt","2 large eggs","30 mL (2 Tbsp) milk","14 g (1 Tbsp) butter, softened","*THE SOUP:","28 g (2 Tbsp) butter","2 stalks celery, diced","2 carrots, peeled and diced","1 Tbsp minced fresh dill","1 Tbsp minced fresh parsley","2 garlic cloves, minced or pressed"],"steps":["*BROTH","Place whole chicken and all other broth ingredients in a large stockpot. Add water until everything is covered by about 2.5 cm (1 in). The exact amount of water depends on the size of your chicken.","Bring water to a boil. Cover, and reduce heat to bring water to a simmer. Allow everything to simmer for about 2 hours. During these 2 hours, begin preparing the egg noodles (see Step 4).","Strain the broth into a bowl and set aside. Separate the chicken from the vegetables, and discard the vegetables (you can eat the vegetables, but they are too mushy for the soup). When cool enough to handle, remove the meat from the chicken and discard the skin and bones.","*EGG NOODLES","Mix together the flour, garlic salt, and 1/2 tsp salt in a large bowl. Whisk together the eggs and milk in a small bowl. Then add the liquid mixture and the softened butter to the bowl of dry ingredients. Stir together until a shaggy ball of dough is formed.","Knead the dough for about 5 minutes, only adding flour to the kneading surface if the dough is excessively sticky. Too much flour will result in tough noodles.","Place the ball of dough in a bowl, cover with plastic wrap, and allow to sit for 30 minutes.","On a floured surface, roll out the dough as thin as you possibly can without tearing the dough. Monitor the dough as you roll to avoid having it stick to the counter.","Use a pizza cutter to cut the dough into 5 mm (1/4 in) strips.  Store the cut noodles on a cookie sheet and allow to air dry as you continue preparing the broth and soup.","When it's time to begin making the soup, bring a large stockpot of water and 1 Tbsp salt to a boil. Add the noodles and cook for 2-3 minutes, or until noodles are done. The noodles will all float to the surface of the water when they are nearly done. Drain the noodles and set aside until it is time to serve the soup.","*SOUP","Place a large stockpot over medium-high heat. Melt the butter, then add the diced celery and carrot. Cook for 5 minutes, stirring occasionally.","Pour the broth into the stockpot. Add the garlic and stir. Bring to a boil and simmer for 5 minutes. Add 2 cups of chicken meat and simmer for an additional 2 minutes. Finally, remove the pot from heat and stir in the minced herbs.","To assemble, first distribute the cooked noodles among six bowls. Then ladle soup into each bowl over the noodles and serve."],"images":["https://i.ibb.co/HFMyb4n/chicken-soup3.jpg","https://i.ibb.co/Wsx81jM/chicken-soup2.jpg","https://i.ibb.co/M7rh6Vp/chicken-soup-noodles.jpg"],"is_published":true,"publish_date":"2020-12-08T03:44:41.844Z","created":"2020-12-07T17:39:48.641Z","ratings":[5],"newsletter":false,"title":"Chicken Noodle Soup From Scratch","size":"5-6","intro":"There is an episode of the ‘90s cartoon series Arthur where Arthur gets sent to the school nurse because he starts hallucinating about a blue elephant in art class. Whoa. He finds out he has chicken pox and spends the next few days at home. Grandma and his parents give him the royal treatment with chicken soup, an oatmeal bath, juice with a crazy straw, and breakfast crepes with sparklers stuck in the top. D.W., Arthur’s sister, declares her jealous feelings toward her brother’s royal treatment by shouting, “When do I get to drink with the crazy straw?”\n\nGrowing up, chicken noodle soup was a meal for the sick kid, as was the case in Arthur. In an effort to reframe my thinking, I’ve come up with this eat-it-when-you-are-sick-or-eat-it-when-you-are-well chicken noodle soup recipe. \n\nThe idea to create this recipe came earlier this year when I was reading a book about recipe development. The author suggested that one of the best exercises for becoming a better recipe developer is to take a classic dish, like chicken noodle soup, and to make your own recipe for it. Months went by and the author’s suggestion lingered in my memory. One day during a recipe brainstorming session I decided to accept her challenge and started plans for the dish you are about to prepare.\n\nJust a heads up - this is a somewhat time intensive and hands-on recipe. Find a day this winter when you have several hours of free time, put some tunes on the speaker, fill your mug with a hot drink, and camp out in the kitchen while you make a stellar chicken noodle soup.\n\nI’ve divided the recipe into three parts: the broth, the noodles, and the final soup. I’ll mention a few things about each section.\n\nSkip the shelves of cans and boxes of chicken broth and head to the poultry aisle. You are going to make today’s broth with a whole, raw chicken. Handling raw chicken, simmering it on the stove for two hours, and finally spending the time to hand-separate the meat from the bones requires effort. Is it worth it? I absolutely think so. Maybe it’s not realistic to make homemade broth everytime you want soup, but it’s a real treat for that special-occasion bowl of chicken noodle soup.\n\nThe good news is that you don’t have to just sit and stare out the window while the chicken is simmering. The noodles also require a bit of work, so you can get a head start on the process while the chicken cooks. These are the classic egg noodles you find in many chicken soups. Like the broth, you are also making the noodles from scratch. In my opinion, the difference between these fresh noodles and dried, packaged noodles is an even greater contrast than the difference between the homemade chicken broth and the canned version. If you for some weird reason had to take a shortcut, don’t take it with the noodles. You’ll never forgive yourself, trust me.\n\nAfter you’ve made the noodle dough, roll it out as thin as possible without tearing the dough. When the noodles cook in the boiling water, they will grow significantly. It won’t be the end of the world if you don’t roll the dough out super thin, you’ll just end up with some meatier noodles in the final bowl of soup. My experience with noodle making is minimal and I’ve never used a pasta roller, so take my advice and instructions with a grain of salt. If you are a noodle master and have special equipment, do your thing and whip up some basic egg noodles to impress the crowds.\n\nWith the hard work done, all that is left is bringing the individual soup components together into a final product. In the recipe I suggest adding 2 cups of chicken meat to the broth and distributing the noodles into six portions. Feel free to adjust to your liking. You will most likely end up with a decent amount of leftover chicken meat. What did I do with it? I made a scrumptious chicken salad the next day, thanks for asking.","quote":"Chicken noodle soup for the soul with ample free time.","description":"You don’t have to be under the weather for chicken noodle soup. Simmer a chicken to make homemade broth, roll out dough for fresh, hand-cut egg noodles, and bring it all together with vegetables and herbs to produce a hot bowl of soup for a wintry afternoon.","keywords":"Chicken noodle soup, soup, made from scratch, egg noodles","prep_time":55,"cook_time":150,"category":"Dinner","cook_method":"Boil, fry","cuisine":"American","__v":0}
{"_id":"5fbd504579966e0008f12377","_type": "recipe", "ingredients":["220 g (1/2 lb) baguette or other crusty bread loaf, one or two days old","42 g (3 Tbsp) butter","175 g (1.25 cups) diced onion","140 g (1 cup) diced celery","1/2 tsp salt","30 g (1/2 cup) chopped kale, stems removed","35 g (1/4 cup) hazelnuts, finely chopped","2 cloves garlic, minced or pressed","1.5 tsp minced fresh thyme","1.5 tsp minced fresh sage","1.5 tsp minced fresh rosemary","4 Tbsp chopped parsley","1 tsp apple cider vinegar","240 mL (1 cup) chicken broth","1 large egg","Fresh ground black pepper to taste"],"steps":["Grease a 20x20 cm (8x8 in) pan.","Cut bread into 1.5-2 cm (0.5-0.75 in) cubes.  Preheat oven to 175° C (350° F).  If the bread cubes are still relatively soft, place them on a baking sheet and put in the oven for about 5 minutes as the oven preheats. Then remove from oven and set aside. You want the bread to feel fairly dry.","Heat a large skillet over medium-high heat. Melt 14 g (1 Tbsp) of butter and add the onion, celery, and 1/8 tsp of salt. Sauté for 6 minutes, stirring occasionally. ","Add the kale and hazelnuts to the skillet and cook for 2 minutes, stirring occasionally. Add the garlic, rosemary, thyme, and sage and cook for 30-45 seconds, stirring constantly.","In a large bowl, add the bread cubes and all the contents of the skillet. Return the skillet to the stove over medium-high heat. Add 120 mL (1/2 cup) chicken broth and the vinegar to deglaze the pan, scraping up any brown bits from the bottom. Add the remaining butter and remaining salt to the pan and stir until all the butter is melted. Remove from heat.","In a small bowl, whisk together the egg and remaining 120 mL (1/2 cup) chicken broth. Pour the skillet liquid mixture and the egg mixture into the bowl of bread. Gently stir to combine, then pour everything into the greased baking dish. Use a spatula to scrape everything from the bowl!","Cover dish with foil and bake in the oven for 35 minutes. After 35 minutes, remove the foil and increase the oven temperature to 200° C (400° F). Bake for an additional 15 minutes until the top is browned.","Remove from oven and serve."],"images":["https://i.ibb.co/jJQnZj7/suffing-1.jpg","https://i.ibb.co/G90H2B1/stuffing-2.jpg","https://i.ibb.co/z27Pc73/stuffing-3.jpg"],"is_published":true,"publish_date":"2020-11-24T19:35:25.47Z","created":"2020-11-24T21:18:22.836Z","ratings":[5],"newsletter":false,"title":"Hazelnut and Kale Stuffing","size":"4-6","intro":"I just finished reading way too many bread jokes on the internet. Just so you know.\n\nBread! More specifically, old bread. We&#x27;re not talking about that warm loaf that just came out of the oven. The one that fills the house with an aroma that kickstarts your appetite even though you just finished a heavy lunch. The one that you spread a thick layer of salted butter on, just to cut another slice and repeat. And repeat. And repeat...\n\nNope. Today is all about that old baguette that&#x27;s been sitting in the bread box for a few days. The one you might use in the neighborhood Wiffle ball game when the plastic bat goes missing (I&#x27;m exaggerating. And yes, I came up with this bread joke myself). Old bread is the star performer of many great dishes: panzanella, french toast, salmorejo (soon to be featured on a Peel the Garlic website near you), strata, bread pudding, annnnnd…stuffing.\n\nThis stuffing recipe varies ever so slightly from the classic. The quintessential flavors - celery, onion, sage, thyme, rosemary, and parsley - are all there. Don’t worry. The difference comes when you throw in hazelnuts, kale, and garlic. \n\nHazelnuts could be hit or miss for you. They are nutty and they are crunchy. If you want a soft bite of stuffing and won’t accept it any other way, this recipe is not for you. With the nuts added, every bite has a bit more texture than what you are probably used to. Try it! I did and I absolutely love it. The earthy flavor of the hazelnuts goes so well with the thyme, sage, and rosemary herbs.\n\nKale anywhere on the Thanksgiving table sounds whack. Well, here it is. For better or worse, the kale does not greatly affect the overall taste of this stuffing. The flavor is there, but since the kale is cooked, its presence is subtle. The reason I add the kale is because it brings a little extra life to the dish. This could be due to my colorblindness, but sometimes I look at a casserole dish full of stuffing and feel slightly bored by lack of visual contrast. Kale is so dark when it cooks, that it looks beautiful against the light color of the bread when pulled from the oven. Additionally, as I mentioned before, the subtle flavor of kale augments the overall complexity of flavors coming together in this recipe.\n\nAnd what’s a recipe on Peel the Garlic without a bit of garlic, ya know?\n\nI should say something about the chicken broth. I make this stuffing with full-sodium broth. Absolutely grab the low-sodium broth if you wish, but just remember that you might need to add a bit more salt than listed in the recipe. And one more broth-related matter. This is not meant to be an intensely moist stuffing recipe. If that’s what you want, pour in a bit more broth when you reach Step 6 of the recipe.\n\nLet’s bring this whole blog post full circle and return to the old bread. Why old bread? Using soft, fresh bread is dangerous because it gets extremely soggy and falls apart as soon as you add the liquid ingredients. Using tougher bread that’s been sitting and drying for a couple days solves this issue. The cubes maintain their structure. The truth is though, it’s difficult to remember to buy bread a couple days before making a recipe. If this happens to you and all you have is soft bread, my suggestion is to cut it into cubes and throw the cubes in the oven for 5 or so minutes while the oven is preheating. The bread will dry out and give you the firm structure you want when adding the liquid ingredients.\n\nWell, there you have it. A small-batch stuffing recipe for those years you have fewer people around the table. And if you do need to make a larger batch, double all the ingredient quantities and bake the stuffing in a 23x33 cm (9x13 in) casserole dish using the same baking times. Happy Thanksgiving and be safe.","quote":"Kale at Thanksgiving is not traditional.","description":"Thanksgiving is different this year. To go along with a non-traditional celebration of a traditional holiday, try mixing up your casserole dish of stuffing this week by including hazelnuts, kale, and garlic.","keywords":"Thanksgiving, bread dish, stuffing, holiday","prep_time":10,"cook_time":75,"category":"Dinner, Side","cook_method":"Saute, Bake","cuisine":"American","__v":0}
{"_id":"5fc667597726450008f704cd","_type": "recipe", "ingredients":["1 kg (2 lbs) yellow potatoes","4-6 large eggs","60 mL (1/4 cup) vegetable oil","1/2 of a large white onion, diced","5 fresh or frozen ají amarillo peppers, seeded, cored, and chopped (can use paste if needed)","2 cloves garlic, coarsely chopped","240 mL (1 cup) evaporated milk","4 saltine crackers","225 g (8 oz) queso fresco cheese","Arugula or green leaf lettuce, for serving","Peruvian Botija olives, or other strong black olives, for serving"],"steps":["*POTATOES","Place unpeeled potatoes in a large pot. Cover with 5 cm (2 in) water, add 1 Tbsp salt, and bring to a boil over high heat. Reduce heat to a low boil and cook for 25-30 minutes. You should be able to easily insert a sharp knife into the potatoes. While the potatoes are cooking, begin working on cooking the eggs and the sauce.","Drain the potatoes. When they are cool enough to handle, peel the potatoes with the help of a knife blade. Slice the potatoes into 1.5 cm (1/2 in) rounds and set aside.","*EGGS","Place eggs in a medium saucepan. Cover with 2.5 cm (1 in) water and bring to a boil over medium-high heat. Once boiling, remove the saucepan from heat, cover, and let sit for 8 minutes. Meanwhile, prepare a large bowl of ice water.","After the 8 minutes, transfer the eggs to the ice water. Let sit for 5-10 minutes before peeling.","*SAUCE","Heat a large skillet over medium-high heat. Pour in the oil. Once hot, add the onion and peppers and cook for 5 minutes, stirring occasionally. ","Add the garlic and cook for an additional 3 minutes.","Use a spatula to transfer the contents of the skillet to a blender. Add the milk and blend until smooth. Add the saltine crackers and the cheese, and blend again until smooth. At this point you can adjust the consistency of your sauce if needed: use additional crackers to thicken, and additional milk to thin.","*ASSEMBLY","Arrange arugula or lettuce leaves on each plate. Position a layer of potato slices on top of the leaves. Pour the sauce over the potatoes making sure they are completely covered. Finish by adding boiled egg halves and olives. Serve and enjoy."],"images":["https://i.ibb.co/8PHWnD7/huancaina.jpg","https://i.ibb.co/2NwS1bq/huancaina4.jpg","https://i.ibb.co/wWT7wSQ/huancaina5.jpg","https://i.ibb.co/crRzSST/huancaina3.jpg"],"is_published":true,"publish_date":"2020-12-01T16:18:28.015Z","created":"2020-12-01T17:40:52.376Z","ratings":[5],"newsletter":false,"title":"Papa a la Huancaína","size":"4","intro":"Some 1,500 or so years ago, somewhere along the northern coast of Peru, a local artist from the Moche civilization sat at her stone table and painted a depiction of a pepper onto a ceramic vessel. That painted pepper represents the same pepper you will be using in today’s recipe: the ají amarillo. I’ll tell you more about the ají amarillo soon, don’t you worry, just know that papa a la huancaína wouldn’t be the same without it.\n\nAs is the case with so many dishes in the world, the origins of papa a la huancaína are debatable. Everyone agrees it comes from Peru, no question there, but exactly where in Peru is the real question. In the 1800s, a family in Poland was exiled for being rebels and standing up to the Tsars. Where did they go? France. One of the children studied engineering in France, became obsessed with railroads, and for some reason decided his skills would best be put to use in Peru. He made the journey to the southern hemisphere and ultimately became the designer of the Trans-Andean railroad that runs through Peru.\n\nI spent nearly every minute of high school and university history classes doodling in my notebook, so if you are bored at this point, don’t feel guilty and just skip ahead to the next paragraph. Anyway, back to the Peruvian railroad and how it relates to today’s recipe. There is a city in central Peru, east of Lima, called Huancayo. In Spanish, something that comes from Huancayo could be referred to as “huancaína.” Are you making the connection? Some people claim that cooks from Huancayo prepared papa a la huancaína to feed the construction workers building the section of the railroad near the city. While that seems logical enough, other people say that papa a la huancaína was actually a dish that was sold at train stations along the route to Huancayo. WHAT IS THE TRUTH?\n\nThe history tittle-tattle is over. As promised earlier, I will now tell you more about ají amarillos. The Spanish word “ají” translates to “chile pepper.” The ají amarillo refers to a specific pepper (the Capsicum baccatum for all you biology nerds). It’s grown along the Peruvian coast and is the most popular and most consumed pepper in Peru. \n\nUnfortunately ají amarillo peppers can be difficult to find outside of South America. If you’re the luckiest and live near a market that sells fresh ají amarillos, I’m very jealous. If you want to make me even more jealous, leave a comment rubbing it in my face. The next lucky option is that you can find the peppers in the frozen section of a specialty shop that imports South American products. The next best option is ají amarillo paste, which you can buy online. I have never used it (I fortunately have access to the frozen option), so do a bit of research before using the paste in a recipe. Lastly, for those of you who can’t find or refuse to pay the shipping costs to get the paste, I’ve seen recipes that use a blend of yellow or orange bell peppers and habaneros. It’s been years since I’ve made this dish with habaneros, but I know they have a higher Scoville rating than the ají amarillo and are therefore much spicier. Remember that when substituting.\n\nOnce you have figured out the pepper situation, the only other product that can be tricky to get your hands on is the jar of Peruvian olives. These olives, called Botija olives, are purple and have a relatively strong flavor profile. Fortunately the olives are just a side ingredient to complement the primary dish, so you can experiment and use another strong black olive.\n\nWhen I lived in Peru I ate papa a la huancaína regularly. I fell in love with the sauce. I’m not going to describe it because I really want you to make it and experience what it’s like trying it for the first time. There is another dish in Peru, ají de gallina, that uses the same sauce and combines it with shredded chicken. If you like today’s dish, try that one next. So good.\n\nEnjoy!","quote":"You win if you know why this sauce is yellow.","description":"Ceramic pots from 200 AD, a family exiled from Poland, and one of the highest railroads in the world. This is the story of the Peruvian dish papa a la huancaína, an appetizer that smothers a bed of yellow potatoes in a rich, creamy and spicy yellow sauce.","keywords":"Peruvian dish, potatoes, aji amarillo, papa a la huancaína","prep_time":10,"cook_time":35,"category":"Appetizer, lunch","cook_method":"boil, fry","cuisine":"Peruvian","__v":0}
{"_id":"5fd8e62b513d4000096a3979","_type": "recipe", "ingredients":["*Dressing","1 Tbsp honey","1 Tbsp mustard","30 mL (2 Tbsp) olive oil","1 tsp cider vinegar","*Brussels Sprouts","225 g (1/2 lb) bacon","550 g (1.25 lbs) brussels sprouts","1 large shallot","100 g (3.5 oz) fresh cranberries","1 large jalepeño","100 g (3/4 cup) walnuts, chopped","15 mL (1 Tbsp) olive oil","2 garlic cloves, minced","1/2 tsp salt"],"steps":["*Dressing","Combine all the dressing ingredients (honey, mustard, oil, vinegar) into a small bowl and whisk until homogeneous. ","*Brussels Sprouts","Wash the brussels sprouts, remove damaged leave, and use a knife to remove most of the tough stem. Don't cut the stem completely off, or the layers of leaves will be more likely to separate. Cut the brussels sprouts in half lengthwise from tip to stem.","Heat a large skillet over medium-high heat. Cook the bacon for 5-7 minutes, or until bacon is cooked and beginning to crisp. Transfer bacon to a paper towel lined plate, leaving the grease in the skillet. You will be cooking the brussels sprouts in the bacon grease, so feel free to remove excess grease if it seems like there is too much.","When the bacon is cool, chop it in to bite-size pieces.","Return the skillet to medium-high heat. Add the brussels sprouts to the skillet. Try to position them in a single layer, cut side down. Allow to cook undisturbed for seven minutes, only flipping the brussels sprouts if necessary to avoid burning.","Reduce heat to medium. Add the 1 Tbsp of olive oil, the shallot, cranberries, and jalapeño. Cook for seven minutes, stirring occasionally.","Add the bacon, walnuts, garlic, and 1/2 tsp salt. Cook for two minutes, stirring frequently.","Pour the dressing into the skillet and stir for one minute. Remove the skillet from the heat and serve immediately."],"images":["https://i.ibb.co/zb57mZq/brussels-sprouts.jpg","https://i.ibb.co/kKz9CQv/brussels-sprouts2.jpg","https://i.ibb.co/7zWgPJN/brussels-sprouts3.jpg"],"is_published":true,"publish_date":"2020-12-15T16:46:57.729Z","created":"2020-12-15T17:51:11.103Z","ratings":[5,5,5],"newsletter":false,"title":"Brussels Sprouts with Bacon, Walnuts, and Cranberries","size":"4","intro":"Last month I was at the grocery store and noticed that fresh cranberries were on sale. It feels weird to have to modify the word “cranberries” with “fresh”, but I’ll admit my mind immediately paints a mental image of Craisins and blobs of canned sauce when I hear the word “cranberries.” Anyway, I bought the bag of on-sale cranberries. I had a vague idea of a dish I wanted to make with brussels sprouts, and the cranberries were the inspiration I needed to start putting the recipe together. \n\nHave you ever eaten a raw cranberry? Woah. When I popped one in my mouth and bit into it, I was immediately rushed back to elementary school playground days when me and my friends would dig Warheads out of our pockets and bust up laughing over the ridiculous faces we were making as our little seven-year-old taste buds were coated with the intense sourness. If you like sour, eat a raw cranberry.\n\nI have something to say about the color profile of this dish. To my color-blind eyes, the pan of green and red looks nothing but normal. My friend, however, told me that the color combination looks “festive.” With ten days left until Christmas, I think you’ll find this dish is the perfect addition to the holly and ivy hanging above your dinner table, the elf costume you may or may not be wearing, and the fir tree in your living room decorated with red ornaments.\n\nAbout the actual recipe. This is a brussels sprouts recipe with a wide range of flavors. The bulk of the dish is made up of brussels sprouts. Before adding anything else, you will cook them until they begin to caramelize, adding a sweet, slightly-charred taste to the overall dish. Then we have bacon, one of the most common brussels sprouts pairings. The bacon provides a salty, savory addition. If you’re very short on time or ingredients, you could stop here and be happy. It’s hard to go wrong with brussels sprouts and bacon. You, however, are dedicated. So you’re not stopping here, riggggght?\n\nAdd walnuts and suddenly the texture of the dish improves dramatically. The earthy, nutty flavor is a bonus as well. What makes this dish really shine is the cranberries. From what I’ve read, overcooking cranberries can cause an overly bitter flavor experience. This is why you’ll only cook them for the last ten minutes on the stovetop. As they cook, they will soften. The overall result will be a tangy flavor that fits perfectly with the caramelized brussels sprouts. \n\nAt the very end of cooking you will add the dressing. The quantity of dressing is not intended to drown the ingredients in the skillet, but you can always scale up on ingredients when making the  dressing if you feel like the dish needs more. \n\nThis is one of those recipes where I consider every ingredient to be extremely important when it comes to the overall flavor. I’m definitely guilty of omitting one or two ingredients when following a recipe because I don’t have it on hand or don’t want to buy it at the grocery store. If possible, don’t make that mistake with this recipe. Enjoy and let me know how it goes!","quote":"Cranberry love <3","description":"Brussels sprouts with bacon is a tried and true combination. To that foundation you’ll add cranberries, walnuts, jalapeño, and a honey mustard dressing for a final product rich in both flavor and texture.","keywords":"Brussels sprouts, cranberries, bacon, walnuts, winter food","prep_time":15,"cook_time":25,"category":"dinner","cook_method":"sautee, fry","cuisine":"American","__v":0}
{"_id":"5ff36c9f257314000839053e","_type": "recipe", "ingredients":["*Squash","2 acorn squash","4 tsp olive oil","salt, for sprinkling over squash","4 thyme sprigs","*Custard","50 g (1.7 oz) ginger","2 whole large eggs","3 egg yolks","180 mL (3/4 cup) heavy cream","240 mL (1 cup) milk","1/2 tsp nutmeg","1/2 tsp salt"],"steps":["*Squash","Preheat oven to 220° C (425° F). Cut squash in half lengthwise, from tip to stem. Use a spoon to scoop and discard the seeds. In order for each half to lay flat and remain stable, slice off a thin strip from the back of each squash half. If this sounds confusing, look at an example in the pictures above. ","Place the four squash halves on a sheet pan. Drizzle each half with 1 tsp olive oil. Place a thyme sprig inside each squash, and sprinkle everything with salt. Bake in the preheated oven for about 50 minutes, or until the squash begins to feel tender.","Remove from the oven, discard thyme, and allow squash to cool to room temperature.","*Custard","Preheat the oven to 150° C (300° F). ","Finely grate the ginger. Transfer the grated ginger to a fine-mesh sieve. Use a spoon to scrape and pass the ginger through the sieve. Discard the remaining solids and set aside the bowl of ginger that passed through the sieve.","In a medium-size bowl, whisk together the eggs, egg yolks, cream, and milk until homogeneous.","Add the salt, nutmeg, and ginger. Stir until combined.","If not still on the pan, place the four squash halves on a sheet pan. Fill each squash half with the custard liquid. Place the pan in the oven and cook for 55 to 65 minutes. The custard will jiggle slightly when done. If using a digital thermometer, the internal custard temperature should be between 75-80° C (170°-175° F). ","Remove from oven and allow the custard-filled squash to cool for at least an hour before serving."],"images":["https://i.ibb.co/nM5pXyb/acorn-squash1.jpg","https://i.ibb.co/BqyQvvC/acorn-squash2.jpg","https://i.ibb.co/52t3ZnH/acorn-squash3.jpg","https://i.ibb.co/Jc119JC/acorn-squash4.jpg"],"is_published":true,"publish_date":"2021-01-04T19:53:18.614Z","created":"2021-01-04T21:14:08.242Z","ratings":[5],"newsletter":false,"title":"Acorn Squash with Ginger Nutmeg Custard","size":"4","intro":"Allow me to get you ready for your next trivia night by filling your head with stories and facts about the beloved acorn squash. Well before any European hit the shores of the Americas, Native Americans in Central and North America were cultivating and enjoying what we know as the acorn squash. Back then, people supposedly grew the fruit for its seeds only, discarding everything else. Today, most recipes (including this one) typically ask you to scoop out and discard the seeds in preparation for cooking and eating the flesh and skin. Now that’s irony.\n\nEventually Europeans started making nautical journeys to the west and were introduced to the acorn squash. At some point, the most common variety of acorn squash was named Table Queen. I like this name so much that I nearly named this recipe Table Queen with Ginger Custard, but figured this might make the recipe nearly impossible to find through Google searches and dropped the idea. Gotta look out for number one, you know.\n\nOne last thing regarding the Table Queen. While it seems that most people agree that the acorn squash is indigenous to the Americas, there are others who claim the little green guy made its way to North America all the way from Denmark. Mostly this means that someone told a lie at some point in history, and now we’re all confused. Lying equals confusion, and that’s where we’re at with the history of the acorn squash.\n\nToday’s recipe is split up into two basic segments. First, you will be halving, preparing, and baking the raw squash sans custard. This is done because acorn squash flesh requires a higher temperature and a longer cook time than custard. If you baked a raw acorn squash bowl filled with the liquid custard simultaneously, you’d either end up with an extremely overcooked custard, or a very undercooked squash. That’s all there is to it.\n\nOnce the squash halves are done with the initial baking, they need to cool down a bit before adding the custard mixture. Add the liquid with eggs in it to a hot surface and you might end up with acorn squash filled with scrambled ginger and nutmeg eggs. Gross.\n\nCustard baking can be very intimidating. As you near the end of the cooking time for a custard, all of a sudden the following questions arise: It jiggles a little, I think? Is it done? Oh wait, maybe it’s too runny in the middle? I inserted a clean knife in the middle of the custard, and I think it’s coming out mostly clean? You know how it goes. If you’ve never baked a custard before, all it takes is a thermometer and a bit of trial and error to go from custard coward to custard...conqueror?\n\nThe basic, need-to-know science behind baked custard is this: custard begins to set at 160° F and begins to curdle at about 180° F. The ideal temperature you should hit before removing it from the oven is 170-175° F. Use a digital read thermometer and your life will be much easier. Since you are cooking the custard in a thick squash shell, I found that any sort of water bath is not necessary.\n\nA few notes on serving. The final product should sit and cool for at least an hour before serving. This will give the custard time to fully set. I consider the dish to taste just as delicious the next day after being stored in the fridge overnight. Happy baking!","quote":"Fine dining with the Table Queen.","description":"The common dark-green acorn squash is also called Table Queen. This recipe roasts the squash halves, fills each one with a silky ginger-flavored custard, and makes everyone who tastes it happy and prosperous. Or something like that.","keywords":"Acorn squash, table queen, winter food, custard, ginger, nutmeg","prep_time":10,"cook_time":120,"category":"Dinner","cook_method":"Roast, bake","cuisine":"American","__v":0}
{"_id":"5ffcc5765b168e0008c8576d","_type": "recipe", "ingredients":["2 medium dried ancho chilis","1 L (4 cups) chicken broth","1 tsp oregano","30 mL (2 Tbsp) olive oil","1 white onion, diced","1 jalapeño, seeds and ribs removed, finely minced","3/4 tsp salt","3 garlic cloves, minced or pressed","450 g (1 lb) yukon gold potatoes, peeled and cubed into 1 cm (1/3 in) cubes","425 g (15 oz) can diced tomatoes","1/4 tsp freshly ground black pepper","250 g (1.5 cups) cooked black beans","Sour cream, for serving","Tortilla chips, for serving"],"steps":["Heat a medium skillet over medium-high heat. Additionally, bring a small pot or kettle of water to a boil. Carefully cut open the ancho chilies lengthwise (stem to tip) and remove all seeds and ribs. Place chili pieces on skillet and toast for about 30 seconds each side.","Transfer toasted chilies to a small heatproof  bowl and cover with boiled water. Let the chilies soak for 25 minutes. Stir the chilies every few minutes to ensure even soaking.","Drain the liquid from the chilies and transfer the now-softened chili pieces to a blender. Add 240 mL (1 cup) of the chicken broth and the 1 tsp of dried oregano. Blend mixture until smooth.","Heat a large stockpot over medium-high heat. When hot, add the olive oil. Add the onion, jalapeño, and 1/4 tsp salt and sauté for 7 minutes, stirring frequently.","Add garlic and stir constantly for 30 seconds. Immediately add the potatoes, tomatoes, remaining chicken broth, and the liquid chili mixture. Stir and bring the contents of the pot to a boil. Simmer for 13 minutes, stirring every once in a while.","Turn off the heat and transfer about half of the soup to a blender. Blend until smooth, and then return the mixture to the pot of soup. Stir in the black beans, and add the black pepper and remaining 1/2 tsp of salt. Stir until combined.","Serve soup with tortilla chips and sour cream."],"images":["https://i.ibb.co/J5MSj1S/ancho-soup1.jpg","https://i.ibb.co/PwHh2J2/ancho-soup2.jpg"],"is_published":true,"publish_date":"2021-01-11T21:39:16.91Z","created":"2021-01-11T23:35:39.61Z","ratings":[],"newsletter":false,"title":"Ancho Chili and Potato Soup","size":"5-6","intro":"For most of my life, I’ve walked past those plastic bags of dried chilies you find at most grocery stores without the slightest hint of stopping to look at, let alone purchase, one of the bags. A few months ago I decided to change that. I’m embarrassed that I’ve spent so many years not cooking with dried chilies. What you get after patiently extracting the flavor from a dried chili is unlike any chili powder or other seasoning I’ve ever tasted. \n\nIf you’ve never cooked with dried chilies (again, I just started a couple months ago), set aside any apprehension you feel about cutting into one of those dark, crinkly pods, and declare to the world today that you are ready to try something new. If you do that, no one will be able to call you anything but cool. Tempting, eh?\n\nThis recipe originally started as an idea for a tortilla soup. I envisioned a light-colored, creamy potato soup topped with nicely contrasting black beans and tortilla strips. Then something happened at the grocery store. I bought some ancho chilies. At home I decided to work one chili into the recipe to boost the flavor of the soup. One chili turned into two chilies. My light-colored soup was suddenly a dark, chili color. In addition to the color change, I no longer wanted all the potatoes pureed, and instead decided to leave half of the potatoes as cubes to give the soup texture. \n\nWhen working with the chilies, you may want to consider wearing food prep gloves. Ancho chilies rank low on the Scoville scale, but still contain capsaicin, the compound in chilies that lights your tongue on fire. Based solely on personal observation, it seems that skin sensitivity to capsaicin depends on the person. I once had a friend who cooked with me, handled a jalapeño with bare hands, and complained of burning fingers for days. Other people, like lucky me, have emotionless fingertips and can handle a habanero with bare fingers and be totally fine. Maybe it has something to do with me touching way too many piping-hot pans and rubbing my fingertips on way too many rocks when rock climbing? Either way, wear gloves if you want to play it safe.\n\nWhen you open your bag of ancho chilies, you’ll notice they are quite dry. They shouldn’t be brittle and bone-dry; they should still be somewhat pliable. Regardless of their level of dryness, you will need to rehydrate the chilies for this recipe. This is done using hot water. After removing the seeds and the white pith (which, did you know, contains 90% of the capsaicin?), you’ll cover the chilies with hot water and allow them to soften for nearly half an hour. Then you will be able to blend the softened chilies with chicken broth and eventually incorporate the rich ancho flavor into the soup.\n\nIf you’ve never cooked with dried chilies before, this recipe should be a nice primer and will hopefully convince you to make them a regular member of your pantry inventory. Enjoy.","quote":"Add some C₁₈H₂₇NO₃ to your soup.","description":"You can thank the ancho chilies for the rich color and complex flavor of this potato and black bean soup. Pick a cold night (or nights) this winter to serve this dish with a dollop of sour cream and a handful of tortilla chips. Enjoy.","keywords":"Ancho chili, soup, potato, potato soup, Mexican recipe","prep_time":30,"cook_time":30,"category":"Dinner","cook_method":"Sautee, boil","cuisine":"Mexican","__v":0}
{"_id":"600f8d222d93110008a83d92","_type": "recipe", "ingredients":["1 kg (2.2 lbs) sweet potatoes","300 g (1/2 lb) turnip","1 garlic clove, unpeeled","30 mL (2 Tbsp) olive oil","30 g (2 Tbsp) butter","1 yellow onion, diced","3 celery stalks, diced","3/4 tsp salt","1/2 tsp freshly grated nutmeg","1/2 tsp ground cinnamon","720 mL (3 cups) chicken broth","300 mL (1.25 cups) heavy cream","50-70 g (1/4 - 1/3 cup) light brown sugar, depending on taste","Walnuts or pumpkin seeds, for topping the soup"],"steps":["Preheat the oven to 220° C (425° F). Peel the sweet potatoes and turnip and cube them into 1.5 cm (0.5 in) pieces. Toss the pieces with the olive oil in a large bowl. Pour contents of bowl onto a sheet pan and rearrange into a single layer. Add the unpeeled garlic clove to the pan.","Place the pan in the oven and bake for 50 minutes. Stir and flip the sweet potato and turnip pieces every 10-15 minutes to encourage even roasting. When done, remove from oven and set aside. Peel the garlic clove when it is cool enough to handle.","Heat a large stockpot over medium-high heat. When hot, add the butter. When melted, add the onion, celery, and 1/4 tsp salt. Saute for 7 minutes, stirring often.","Add the chicken broth, roasted vegetables, roasted garlic clove, nutmeg, and cinnamon. Bring to a boil and then remove from heat. Stir in the cream, remaining 1/2 tsp salt, and brown sugar. Stir to combine.","Use an immersion blender or a stand blender to puree the entire soup. Work in batches if necessary, and be careful as a closed blender builds pressure if its contents are hot.","Return to the stockpot over medium heat and heat for a few minutes, or serve immediately if the temperature of the soup is already to your liking."],"images":["https://i.ibb.co/rQ69vB7/sweet-potato-soup.jpg"],"is_published":true,"publish_date":"2021-01-26T04:54:00.17Z","created":"2021-01-26T04:52:50.816Z","ratings":[],"newsletter":false,"title":"Roasted Sweet Potato Soup","size":"4-6","intro":"And when I say sweet, I mean sweet.\n\nTo kick things off, I’m going to tell you something that will change your life if you own an aquarium. Did you know you can grow sweet potato vine indefinitely in water? Not only that, the vine will grow faster and healthier if the roots are fed fish poop. Grow sweet potato vine in your aquarium, and all of a sudden you have some homegrown water filtration that doubles as a great hide-and-go-seek spot for your fish friends.\n\nSomething else you should know: there’s a debate in the world about whether the start of our soup today should be spelled “sweet potato” or “sweetpotato.” If you want to know which version your word processor supports, type out “sweetpotato” and see if you get the slap-on-the-wrist squiggly red line. I’m serious though, some groups say the name of the orange-colored root should be squashed into one word since sweet potatoes&#x2F;sweetpotatoes are not actually potatoes. For the rest of this post I will refer to sweet potatoes as sweetpotatoes just for the fun of it.\n\nAnyway, this soup has the potential to be really sweet and may even teeter on the verge of being liquid candy. If you want that, add the full ⅓ cup of brown sugar. If not, take it down to ¼ cup or even less. It depends on you and it depends on your dinner guests. Are they younger than 9, or are they older than 79? You know?\n\nI chose to pair the sweetpotatoes with a turnip. Root buddies for life. The turnip, when roasted, provides an additional sweetness and a subtle earthy flavor. Included in the roasting party is a single, unpeeled garlic clove. I’ve been studying Mexican cuisine recently, and have done a fair amount of dry roasting and oven roasting unpeeled garlic cloves. You could say I was inspired when making this soup.\n\nThe soup base, before adding the roasted vegetables, is made of celery and onion sauteed in butter and chicken broth. Some ground nutmeg and cinnamon are added to give the whole soup a very wintery feel. Try to tell me nutmeg and cinnamon don’t make you think of a cozy winter.\n\nOnce everything is combined and happy in the soup pot, you’ll be pureeing it all into a creamy final product. My all-time favorite way to puree a soup is by using an immersion blender. If you don’t have one, a stand blender will be fine. Depending on the size of your blender, you’ll most likely need to puree in multiple batches. I’d suggest only filling the blender half-full of soup each batch so you don’t end up with soup on the ceiling. It happens.\n\nAll that remains is to ladle the soup into bowls, top it with some chopped walnuts or pumpkin seeds, and serve the whole caboodle with some warm bread and butter.","quote":"\"Sweet potatoes\" or \"sweetpotatoes\"?","description":"Some say sweet potatoes, others say sweetpotatoes. Either way, this indulgent soup, featuring turnip, roasted garlic, and nutmeg, goes heavy on the creaminess and heavy on the sweetness. Pair it with some bread and butter, and life will be good.","keywords":"Soup, sweet potato, turnip, sweet, roasted vegetables","prep_time":15,"cook_time":65,"category":"Lunch, dinner","cook_method":"Roast, saute, boil","cuisine":"American","__v":0}
{"_id":"6018bf786aa2f0000855d76a","_type": "recipe", "ingredients":["*Falafel","400 g (2 cups) dried chickpeas","1/2 tsp baking soda","1/2 large onion, diced","6 cloves garlic, coarsely chopped","50 g (1 cup) parsley, chopped","25 g (1/2 cup) cilantro, chopped","1 tsp salt","1 tsp black pepper","2 tsp cumin","1/2 tsp dried red pepper flakes","1 Tbsp sesame seeds","1 tsp baking powder","neutral oil for frying","*Tahini Sauce","130 g (1/2 cup) tahini","40 mL (2.5 Tbsp) fresh lemon juice","1/2 tsp salt","1 garlic clove, minced","75 mL (5 Tbsp) water"],"steps":["*Falafel","The day before, place the chickpeas and baking soda in a large bowl. Fill bowl with cool tap water until water covers the chickpeas at least 2 inches. Let the bowl sit uncovered for 24 hours. If short on time, you can reduce the soak to 18 hours.","Heat a small skillet over medium heat. Add the sesame seeds and toast briefly, about 20 seconds. Be sure to stir constantly as sesame seeds are quite easy to burn. Immediately transfer from the skillet to a small bowl.","Drain and rinse the chickpeas. The next step may need to be divided into two batches, depending on the size of your food processor. In the food processor, add the chickpeas, parsley, cilantro, onion, garlic, sesame seeds, and spices (salt, black pepper, cumin, coriander, red pepper flakes). Process the ingredients until you obtain a semi-fine, grainy like mixture. You may need to occasionally scrape down the sides of the food processor.","Transfer the mixture to a bowl, cover with a lid or plastic wrap, and refrigerate for one hour. Meanwhile, you can jump ahead and prepare the tahini sauce.","In a stockpot or dutch oven, add enough oil so that the oil is a few inches deep. Heat the pot over medium-high heat until the temperature reaches about 175° C (350° F). Remove the bowl from the refrigerator and stir in the baking powder. Use your hands to gather about 2 Tbsp of the mixture. Roll into a ball and then gently smash into a disc about 4 cm (1.5 in) in diameter. The size and shape are really up to you.","Working in batches, add the discs to the hot oil using a slotted spoon. Allow them to fry for 4-5 minutes, or until the falafels are dark brown in color. Remove from oil and transfer to a paper-towel lined plate.","Serve with tahini sauce and tzatziki sauce (recipe not included).","*Tahini Sauce","In a small bowl, combine tahini, lemon juice, salt, and garlic. Stir until combined.","Gradually stir in water until you've reached a desired consistency. For me, this was 5 Tbsp. Adjust to your liking."],"images":["https://i.ibb.co/jLtVmRL/falafel1.jpg","https://i.ibb.co/m8D3KDM/falafel2.jpg"],"is_published":true,"publish_date":"2021-02-02T03:20:57.589Z","created":"2021-02-02T22:52:36.492Z","ratings":[5],"newsletter":false,"title":"Falafel and Tahini Sauce","size":"5-6","intro":"Some of my recipes I develop from scratch. I stand in my kitchen, open the pantry, stare into the fridge, sniff spices, and am often quite inspired by what I have on hand. Some of these improv dishes end up tasting so good that I take the plunge and work on developing them into replicable recipes.\n\nOther times, my recipe development is based around a well-established dish. Having lived in France in Belgium, you’ll find a handful or two of recipes with European origins on this site. When I develop these recipes, I like to immerse myself in the history and lore surrounding the dish. Sometimes, it can be hard to find much regarding the story of the recipe, especially in a language I can read (thank Google for Google Translate).\n\nToday’s dish, on the other hand, has a plethora of very informative articles and stories all over the web. Falafel, I’ve learned, has deep connections to one of the world’s longest, ongoing conflicts: the Israeli-Palestinian conflict. I’m not going to explain the conflict in this blog post, but I’ve gone down a very interesting rabbit hole reading about the history of the falafel within the context of the controversial conflict. If you’re interested, start with the New York Times article titled, “A History of the Mideast in the Humble Chickpea.”\n\nFrom what I’ve discovered, it appears the general consensus is that the falafel originated in Egypt. Coptic Christians weren’t allowed to eat meat during the Lent holiday, still wanted to eat something akin to meat, and ended up creating the original falafel with fava beans. With a little movement and a little time, the recipe eventually made its way north across the border and into the Israel&#x2F;Palestine region. Again, for more info on the matter, check out the above-mentioned article.\n\nI made my first attempt at making falafel in college. Other than canned chickpeas, I really can’t remember what other ingredients I used. I do remember that the end result was a crumbly pile of fried something sitting on a paper towel. I passed the whole process off as being too difficult and returned to my daily peanut butter and honey sandwiches.\n\nYears passed and I eventually decided to give the whole thing another go. Today I present to you what I make when I’m in the mood for falafel. If you’re used to making falafel with canned or other cooked chickpeas, you’re in for a new experience! Exciting or what. In this recipe, the general idea is that you soak the dried chickpeas for an entire day, and then process them raw in a food processor with the other supplementary ingredients. From there, everything chills a bit longer, and then is formed into patties that take a deep dive into hot oil.\n\nIn addition to chickpeas, these falafel contain ingredients you might find in your everyday falafel: onion, garlic, fresh herbs, and a healthy dose of spices. If you don’t have red pepper flakes on hand, feel free to use cayenne pepper as a substitute. You’re not trying to make the falafel spicy, the heat just gives the overall flavor a bit more body.\n\nPart two of this recipe is the tahini sauce. There is nothing complicated or difficult about this sauce, but it tastes so good with the falafel. You’ll combine the tahini, lemon juice, salt, and garlic, and then gradually add some water to thin the sauce to a consistency you are happy with.\n\nWhen it comes time to serve, accompanied by the tahini sauce and maybe a bowl of tzatziki, these falafel do pretty well on their own. These are independent falafel, you could say.","quote":"Worth the 24-hour soak.","description":"Keep that can of chickpeas in the pantry. After soaking dried chickpeas for a day, you’ll combine them with fresh herbs, an array of spices, onion, and garlic. It all goes into the food processor and is then formed into patties ready for deep-frying. The crispy falafel paired with a creamy tahini sauce makes a meal worth the 24-hour soak.","keywords":"Falafel, Egyptian, Israeli, Palestinian, Tahini, Chickpea","prep_time":1500,"cook_time":20,"category":"Lunch, Dinner","cook_method":"deep-fry","cuisine":"Egyptian, Israeli, Palestinian","__v":0}
{"_id":"6021deeb03cb190008556a8f","_type": "recipe", "ingredients":["1 kg (2.2 lbs) ripe tomatoes","200 g (1/2 lb) baguette or day-old, white bread","2 garlic cloves","150 mL (5 oz) olive oil","1 Tbsp sherry vinegar or red wine vinegar","1/2 tsp salt","2-4 hard boiled eggs, for serving","Prosciutto, for serving"],"steps":["\nWash, core, and coarsely chop the tomatoes. Puree the tomatoes in a blender. Place a fine-mesh sieve over a bowl, and pour the tomato puree into the sieve. Use a spoon or spatula to scrape and pass the tomato mixture through the sieve. Discard the remaining solids left in the sieve.","Coarsely chop the bread and place in blender. Pour the tomato puree over the bread. Let the bread soak for 10 minutes.","Peel and cut the garlic cloves in half lengthwise, from tip to stem. On the cut side of each garlic half you should see a thin core running up the clove. This is called the germ. Remove it from each clove half. Then mince or press the garlic and add it to the blender.","Add the vinegar and salt and then turn on the blender. While the blender is running, slowly pour in the olive oil. Blend until everything is smooth and no lumps remain.","Serve at room temperature or chilled. Chop the eggs and prosciutto add to the top of the soup when serving."],"images":["https://i.ibb.co/pPkJLRd/salmorejo.jpg"],"is_published":true,"publish_date":"2021-02-09T20:05:46.448Z","created":"2021-02-09T20:04:30.003Z","ratings":[],"newsletter":false,"title":"Salmorejo","size":"4","intro":"A few years ago, my friend and I had a two-week break from our jobs and decided to take a tour of Spain. One of our first stops was to a city in southern Spain called Seville. I have three very vivid memories from Seville. \n\nNumber one: wood. There is an outdoor structure called the Metropol Parasol that is supposedly the world’s largest wooden structure. It’s super cool, so look it up. \n\nNumber two: flamenco. Seville is the capital of the Andalusia region of Spain. Andalusia is where the music traditions of flamenco originate. On our second night in town, our host recommended we visit a nearby flamenco bar. We went in, ordered a drink, and joined the crowd at a wooden table. In the middle of the room was a guitarist and an old man singing a super sad song with energy like no other. The song ended, and suddenly everyone got up and followed the musicians out of the room and into the entryway of the bar. They motioned for all of us to move in closer and then started another song. The music was emotional, the crowd’s energy intimate, and the overall experience a gem in my mental bank of memories. \n\nNumber three: salmorejo. Today’s recipe. You may have never tried salmorejo, let alone heard of it. I hadn’t until I tried it in Seville. We were couchsurfing at the time, and we went for a walk around town with our host. On the walk, he took us into a bar. We stood at a high, round table, and ordered a few tapas, just like everyone else in the room. That’s when I had my first taste of salmorejo. I was hooked. \n\nSalmorejo is one of Spain’s many cold soups. Back in August I shared my recipe for another excellent, non-hot soup from Spain called gazpacho. Salmorejo has a relatively short list of ingredients. It’s primarily composed of bread, tomatoes, and olive oil. These ingredients, combined together, give the soup its striking orange color. \n\nYou’ll notice the soup includes two cloves of garlic. If you want to go lighter on the garlic, use one. Either way, I’m going to fill you in on a garlic secret. Inside each clove of garlic is a thin sprout we call the germ. As garlic cloves age, the germ increases in pungency and can develop an acrid flavor. Removing the germ diminishes some of the unwanted flavors associated with raw garlic, while keeping the warm, spiciness that makes garlic so good. I’ve read that if your garlic is young and fresh, you can keep the germ without any negative side effects. If you don’t know the age of those garlic cloves sitting on your kitchen counter, however, maybe give this trick a try and send the germ to the trash.\n\nSalmorejo is typically served either chilled or at room temperature. Don’t turn this into a warm soup, unless you’re feeling mega experimental. I’ve never done it and have no plans to. Some people treat the soup as an entire meal, especially if you include the chopped hard boiled eggs and prosciutto. Other times, the soup is simply served alongside other appetizers, or “tapas,” as they call them in Spain. Whatever you decide to do, pat yourself on the back for adding yet another soup to your repertoire of cold soups.","quote":"Cold soup of the day.","description":"The southern region of Spain called Andalusia has quite a bit to boast about: the largest wooden structure in the world, flamenco, and today’s recipe, salmorejo. Composed of a simple blend of tomatoes, bread, and olive oil, salmorejo can be enjoyed as a standalone meal when served with the classic hard boiled eggs and prosciutto.","keywords":"Spanish cuisine, tapas, cold soup, soup, Andalucia","prep_time":20,"cook_time":10,"category":"Lunch, Dinner, Tapas","cook_method":"Cut and chop, blend","cuisine":"Spanish","__v":0}
{"_id":"602ad39fb8a69400085d59cd","_type": "recipe", "ingredients":["*Tomatillo Chili Sauce","8 garlic cloves, unpeeled","3 small to medium dried ancho chilies","500 g (1 lb) tomatillos, husks removed, then rinsed","1 jalapeño","2 Tbsp vegetable or canola oil","1 tsp salt","1 large white onion, diced","1 large Roma tomato, cored and coarsely chopped","*Seasoned Rice","400 g (2 cups) white rice","1 tsp ground turmeric","1/2 tsp ground cumin","1/4 tsp ground cinnamon","1/8 tsp ground cayenne pepper","1 Tbsp vegetable or canola oil","800 mL (3.5 cups) warm water","*Chicken and Serving","4 bone-in chicken thighs, about 800 g (1.7 lbs) total","80 mL (1/3 cup) chicken broth","2 Tbsp pumpkin seeds","2 Tbsp chopped cilantro"],"steps":["*Tomatillo Chili Sauce","Heat a skillet (preferably cast iron) over medium-high heat. When hot, toast the unpeeled garlic cloves for 7 minutes. Stir occasionally to avoid burning. Dark spots are okay and expected. Peel when cool enough to handle.","Carefully slice the chilies lengthwise (stem to tip) and remove the seeds and ribs. Toast the chilies on the hot skillet for about 20-30 seconds per side. Place the toasted chilies in a bowl and cover with hot water. Let the chilies sit in the bowl for 30 minutes, stirring occasionally. Drain after 30 minutes.","Preheat the oven broiler to its highest setting. Place the oven rack about six inches beneath the broiler. Arrange tomatillos and jalapeño on a baking sheet. Broil until the top surface of everything begins to char, then flip the tomatillos and jalapeño and repeat. I find the time required varies greatly based on your oven broiler and how close the pan is to the element. My oven takes about 10 minutes per side, but keep a close eye while broiling as your situation may differ.","When cool enough to handle, remove the seeds and ribs from the jalapeño.","Place a dutch oven or large stockpot over medium-high heat. When hot, add 1 Tbsp oil. Add the onion and 1/2 tsp salt. Cook for five minutes, stirring frequently. Remove from heat.","Combine the garlic cloves, chilies, tomatillos, jalapeño, tomato, and remaining 1/2 tsp salt in a food processor. Process until nearly pureed. Small chunks are fine.","*Seasoned Rice","Place the rice in a fine-mesh sieve and rinse under water for about two minutes. Place the rice in a medium bowl and cover with water. Let sit for 30 minutes. Strain the rice in a fine-mesh sieve and let sit over an empty bowl for 15 minutes.","While the rice is soaking and straining, combine the turmeric, cumin, cinnamon, cayenne pepper, and oil in a small bowl. Stir until combined and allow to sit for at least five minutes.","Combine rice and 800 mL (3.5 cups) water in a medium saucepan. Place over high heat. Stir in the spice-infused oil mixture. This may look strange as the oil and water will appear separated. Don't worry.","When the water has reached a boil, reduce heat to a simmer and cover. Simmer for 12 minutes. Remove from heat, keeping the saucepan covered, and let sit for 10 minutes. Remove the lid and fluff.","*Chicken and Serving","Using your fingers and a paring knife, remove the skin and any excess fat from the chicken thighs.","Place a dutch oven or large pot over medium-high heat. When hot, add 1 Tbsp oil. Add the chicken and sear undisturbed for about 2 minutes each side until browned. Transfer the chicken to a plate and set aside.","Carefully add the chicken broth to deglaze the pan - use a spatula to free all the brown bits from the pan bottom. Add the tomatillo chili sauce and bring to a simmer. Place the chicken thighs in the pan; they do not need to be submerged. Lower to a simmer, cover the pot, and let everything cook for about 20-25 minutes. You want the chicken temperature to hit 85° C (185° F).","To serve, make a bed of rice on each plate. Place a chicken thigh on top of the rice. Spoon a generous amount of the sauce over the chicken. Top the chicken and sauce with pumpkin seeds and cilantro."],"images":["https://i.ibb.co/VBTCPnn/tomatillo-braised-chicken1.jpg","https://i.ibb.co/CH3Gh7n/tomatillo-braised-chicken2.jpg","https://i.ibb.co/QNvyrVs/tomatillo-braised-chicken3.jpg"],"is_published":true,"publish_date":"2021-02-15T20:27:26.186Z","created":"2021-02-15T21:54:06.707Z","ratings":[],"newsletter":false,"title":"Tomatillo and Chili Braised Chicken","size":"4","intro":"When I was a kid I loved rearranging the furniture in my bedroom (after I graduated from a sibling-shared living space, of course). My feng shui practice was top notch. Sometimes I would just sit and brainstorm the next layout. The ideas would click in my brain. Rotate the bed ninety-degrees. Swap the dresser to the opposite wall. Place the small desk in the corner. Move the monkey that sucks his thumb front-and-center of all the stuffed animals. It worked in my brain, and as long as I was strong enough to push things around, it worked in practice. \n\nThat mental gift returned when creating this recipe. I spent a good week envisioning in my brain the components for the meal you are about to make and enjoy. It feels good when that sort of inspiration comes along, and even better when I can refine the mental imagery into an actual recipe.\n\nNow let’s talk about collagen. Collagen seems to be a buzzword these days. I haven’t really looked into why, but I do know I have walked down grocery store aisles and have seen plastic tubs advertising collagen you can put in a milkshake maybe? Anyway. The collagen we’re talking about today is found in chicken thighs. It’s that collagen that ultimately makes chicken thighs and legs silky and tender when cooked right.\n\nWhat I’m about to tell you may not sound appetizing, but it is what it is, and is just a hard-fact about the food we eat as voluntary meat eaters. Collagen is a protein and is found in abundance in chicken thighs and legs. Well, collagen starts to melt at around 150° F or so (the temperature is debatable, according to what I’ve read. Correct me if you actually know.). This melting is more scientifically called denaturation. So the collagen denatures and ends up turning into gelatin. What is gelatin like? Tender and silky. At 185° F, your chicken reaches maximum gelatin levels. \n\nThe result of all this is an extremely tender piece of meat. If you had stopped cooking the chicken at the normal 160° F, like you would a chicken breast, the thigh meat would still be quite chewy as the collagen-to-gelatin conversion would just be starting. There is a bit of give and take with the whole process. The longer chicken cooks, the more moisture it will lose. In the case of thighs or legs, the gelatin makes up for it. \n\nToday you will be cooking chicken thighs until they reach 185° F. To do this, you will braise them in a sauce for nearly half an hour. The sauce consists of several roasted ingredients. The garlic cloves and chilies will be roasted on the stovetop, while the tomatillos and jalapeño will go under the broiler for a nice char-treatment. It all gets combined with onion and tomato in the food processor and results in a smoky puree. \n\nThe braised chicken and tomatillo chili sauce are served with some seasoned rice. Combining turmeric, cumin, cinnamon, and cayenne pepper, you’ll end up with a pot of colorful, flavorful rice. When it comes time to serve, the dish gets topped with a sprinkling of cilantro and a handful of pumpkin seeds. Enjoy.","quote":"Sometimes 185° is better than 160°.","description":"By braising chicken thighs to the right temperature in a roasted puree of garlic, tomatillos, onion, jalapeño, and chilies, you’ll end up with extremely tender meat that gets served on a bed of seasoned rice with pumpkin seeds and fresh cilantro.","keywords":"Braised chicken, chilies, tomatillos, seasoned rice","prep_time":30,"cook_time":60,"category":"Dinner","cook_method":"Braise, boil, toast, sear","cuisine":"Mexican","__v":0}
{"_id":"603483ade8383a0009e01788","_type": "recipe", "ingredients":["*Crust","65 g (4.5 Tbsp) butter, chilled and cut into small cubes","150 g (1.25 cup) flour","3/4 tsp salt","2 tsp sugar","25 g (2 Tbsp) shortening, chilled","60-75 mL (4-5 Tbsp) ice water","*Quiche Filling","200 g (7 oz) bacon","1 large shallot, finely chopped","250 g (9 oz) white mushrooms, cleaned and sliced","28 g (2 Tbsp) butter","3/4 tsp salt","200 mL (6.5 oz) heavy cream","150 mL (5 oz) milk, 2% if possible","4 large eggs","1/4 tsp freshly ground nutmeg","70 g (2.5 oz) swiss cheese, grated"],"steps":["*Crust","Combine butter, flour, salt, and sugar in a food processor. Pulse about times.","Add the shortening and pulse another 4 to 5 times. The mixture should resemble very coarse meal.","Transfer the mixture to a large bowl. Add 60 mL (4 Tbsp) ice water. Use a rubber spatula to smash and combine the dough. If the dough appears dry, add the extra 15 mL (1 Tbsp) of ice water; I usually always use all 75 mL (5 Tbsp) of ice water.","Use your hands to remove the dough from the bowl and press into a cohesive mass. Flatten the dough into a disk and wrap tightly in plastic wrap. Refrigerate the dough for at least two hours. ","Remove from the fridge let the dough sit at room temperature for 15-20 minutes. Lightly flour a large surface and use a rolling pint to roll out the dough into a circle of about 33 cm (13 in). ","Lightly flour the dough and then gently fold in half once. Turn the dough and fold in half again so you have a folded dough wedge that resembles a slice of pizza. Carefully transfer the wedge to a 22 cm (9 in) pie dish. Unfold the dough. Begin to \"drop\" the dough into the dish by lifting the overhanging dough and pressing it into the bottom of the dish. However you do it, avoid stretching the dough.","Preheat the oven to 190° C (375° F) with the rack at the middle height. Refrigerate the pie dish uncovered for 40 minutes. Then place in the freezer for 15 minutes. Cover and line the dough with a sheet of foil. Fill the foil with dried beans or pie weights if you have them. Bake for 15 minutes. Remove the foil and weights and bake for an additional 10 minutes.","Remove from oven and allow to cool.","*Quiche Filling","Preheat the oven to 175° C (350° F) with the oven rack at the middle height.","Place a large skillet over medium-high heat. Add the bacon and fry until nearly crisp. Transfer to a paper towel lined plate. Chop the bacon when cool enough to handle.","Return the skillet to medium heat and cook the shallots for 2 minutes in the bacon grease (you can drain some grease beforehand if there is an excess amount).","Heat a different large skillet over medium-high heat. Add the butter. When melted and hot, add the mushrooms. Cook for about 5 minutes, mostly undisturbed, and then flip and cook for another 5 minutes. You want most of the water to be cooked out of the mushrooms so that they begin to caramelize.","Chop the cooked mushrooms when they are cool enough to handle. Transfer to a large bowl and add 1/4 tsp salt. Add the bacon and shallots and stir to combine.","In a medium bowl, combine the cream, milk, and eggs. Whisk to combine until the color is homogeneous and no streaks remain. Add 1/2 tsp salt, the nutmeg, and the swiss cheese. Stir to combine.","Spread the bacon-shallot-mushroom mixture on the bottom of the crust. Pour the liquid mixture on top. Bake in the oven for 40-45 minutes.","Remove from the oven and let cool on a wire rack for at least 15 minutes before cutting and serving."],"images":["https://i.ibb.co/sw0XfWR/quiche.jpg"],"is_published":true,"publish_date":"2021-02-23T04:53:18.911Z","created":"2021-02-23T14:41:12.504Z","ratings":[],"newsletter":false,"title":"Quiche with Bacon and Caramelized Mushrooms","size":"5","intro":"Something I really don’t love doing is making a pie crust. I’m optimistic and hope that one day I’ll grin and throw my hands in the air every time I get to make a crust, but that day has yet to come. \n\nIn the development process of today’s recipe, the quiche filling has undergone minor modifications, while the crust has been a real piece of work. When I first decided to create a quiche recipe, I did quite a bit of research regarding the ingredient ratios other people use in their quiche crust recipes. I made a chart, found the common ratios, and decided to do what felt right and just go for it. I added a bit too much flour and not quite enough water. The dough was overly-crumbly and split into a jigsaw puzzle when I tried to transfer it to the pie dish. The kitchen was not a happy place in those moments.\n\nI patched together the crust the best I could, added the filling, and threw it in the oven. The flavor was superb and the filling looked great, but that crust. It was dense, undercooked, and just plain weird. I ate it, but I was pouty. I pushed the project to the side and moved on to other (easier?) endeavors.\n\nEventually I decided to quit being the baby I was being and returned, determined to pull a successful quiche out of my oven. I gathered more reading materials (online recipes, cookbooks, opinion articles) and extended my research. I have to say, there is a lot of contradictory crust-making advice out there. Use the freezer. Actually, stay out of the freezer. Use an egg. Wait, eggs are for the birds. Mix quickly with your fingers. No way, a metal blade in the food processor is way better than a finger. Confusing, you know what I mean?\n\nAnyway, I combined and focused on a few methods that ultimately ended up working for me. I definitely would not call myself a pie crust expert, but what you have today is a crust I am satisfied with that represents my personal learning journey. \n\nI’ll say a few things about the quiche itself and then leave you in peace to cook. A quiche is just a savory custard with extra bits, like meat and vegetables, added to it. Being a custard, the liquid base is naturally a combination of eggs, milk, and cream. As additions to the quiche, I chose to pair bacon, mushroom, shallot, and swiss cheese. All are fairly common in quiche recipes. When cooking the mushrooms, keep them in the pan a bit longer than you maybe normally would. I aimed for caramelized mushrooms. For this to happen, all the water inside of them needs to be cooked out. For me this took about five minutes per side over medium-high heat.\n\nEnjoy and don’t hesitate to share any comments below!","quote":"Savory custard.","description":"Successfully making a quiche crust can be tricky. Developing this recipe was a learning experience for me, and I’m happy to now share the final result. Full of caramelized mushrooms, crispy bacon, sauteed shallots, and swiss cheese, a slice of this quiche will look like a real winner on your plate.","keywords":"Quiche, quiche crust, pie crust","prep_time":120,"cook_time":80,"category":"Lunch, Dinner","cook_method":"Bake, Sautee","cuisine":"French, American","__v":0}
{"_id":"603dc82d56f88f0009cc9380","_type": "recipe", "ingredients":["*Braised Cabbage","15 mL (1 Tbsp) olive oil","1 white onion, chopped","900 g (2 lbs) red cabbage, cored and thinly sliced","1.5 tsp salt","240 mL (1 cup) water","30 mL (2 Tbsp) apple cider vinegar","1 Tbsp dijon mustard","1 Tbsp sugar","freshly ground black pepper, to taste","1 cup loosely packed parsley, chopped","*Pork Medallions","450 g (1 lb) pork tenderloin","1/2 tsp salt","1/4 tsp black pepper","28 g (2 Tbsp) butter","*Pan Sauce","14 g (1 Tbsp) butter","1 pear, peeled, cored, and chopped","240 mL (1 cup) lager","5 mL (1 tsp) Worcestershire sauce","1 tsp dried rosemary","*Serving","100 g (3.5 oz) Gorgonzola cheese, crumbled","Chopped parsley"],"steps":["*Braised Cabbage","Heat a large pot over medium-high heat. Add the olive oil and 1/2 tsp salt. Add the onion and saute for about 5 minutes, stirring occasionally. ","Add the cabbage, remaining 1 tsp salt, and water, and bring to a boil over high heat. Lower the heat until you reach a simmer. Cover and simmer for 30 minutes. Give the contents a stir every 10 minutes.","Uncover and add apple cider vinegar, mustard, sugar, and black pepper. Increase the heat to medium-high and cook uncovered 5-10 minutes, or until most of the remaining liquid has evaporated.","Remove from heat and stir in parsley.","*Pork Medallions","Use a sharp knife to cut the white layer of connective tissue, referred to as \"silver skin\", off of the pork tenderloin. Slice the pork into 2.5 cm (1 in) medallions.","Sprinkle the medallions on both sides with salt and pepper.","Heat a large skillet, preferably cast iron, over high heat. When hot, add the butter. Once melted, place the medallions in the pan. You may have to work in two batches to avoid overcrowding. Cook undisturbed for 1 minute 30 seconds. Flip the medallions and cook the other side also for 1 minute 30 seconds. Transfer the pork to a plate to rest while you make the pan sauce. Keep the drippings in the pan","*Pan Sauce","Heat the same pan you used to cook the pork over medium heat. Add the butter. Once melted, add the pear and black pepper. Cook for 3 minutes, stirring frequently.","Add the rosemary and salt and cook an additional 30 seconds.","Add the lager and Worcestershire sauce. Bring to a boil, then lower to a simmer and cook for 2 minutes.","Add the pork medallions to the sauce and continue to cook 3 to 4 minutes, or until the pork reaches an internal temperature of 62° C (145° F). Don't let the temperature go much higher!","*Serving","Plate the braised cabbage and medallions side by side. Sprinkle a generous amount of Gorgonzola cheese and parsley on top of the cabbage. Spoon the pan sauce over the medallions. Enjoy!"],"images":["https://i.ibb.co/fnWf7kp/medallions1.jpg","https://i.ibb.co/pZ5V4xs/medallions2.jpg"],"is_published":true,"publish_date":"2021-03-02T15:24:16.543Z","created":"2021-03-03T23:09:20.926Z","ratings":[5],"newsletter":false,"title":"Pork Medallions, Braised Cabbage, and Pear Lager Sauce","size":"4","intro":"A couple weeks ago I talked about how cooking meat that contains collagen to 180° F will result in an extremely tender texture. Today I have a different story. In the world of meat, another protein exists called elastin. Like collagen, elastin is also a sort of connective tissue. Unlike collagen, however, elastin will not soften and melt, regardless of how long you cook it. You know those bites of steak that leave you chewing and chewing as if you had a piece of rubber in your mouth? You end up with the same experience if the elastin is not removed from the meat before cooking.\n\nIn today’s recipe, the elastin is found on the pork tenderloin. You’ll find a thin sheet of white connective tissue covering one side of the tenderloin. This goes by the name of “silver skin.” If you leave the silver skin on, two things will happen as you cook the pork. First, as I mentioned before, the silver skin will not soften. It will remain rubbery and inedible. Second, the silver skin will contract as it cooks. This causes the edible meat to get pulled and twisted as well, resulting in an unpleasant, shrunken final product.\n\nIf this all sounds scary, just know that all you have to do is remove the silver skin. A sharp knife and some careful cutting and all silver skin worries will be put to rest.\n\nLet me describe the overall vision of what you are about to make. On one side of the plate will be a bed of melt-in-your-mouth braised red cabbage. With the help of the acidic property of apple cider vinegar, the color of the cabbage should be jaw-droppingly bright. Sprinkled on top of the cabbage will be crumbled Gorgonzola cheese and chopped parsley leaves. The color contrast is wild. Next to the cabbage and cheese will sit two or three butter-seared pork medallions. These medallions will be coated in a pear and lager pan sauce.\n\nOn to the cabbage. Years ago I was working in a prep kitchen. One day the chef brought me a bin of whole cabbages and told me to slice them. It sounded easy, but after grabbing a knife and placing the first cabbage on the cutting board, I felt stumped. I tried a couple methods before he came by, seemingly disappointed, and showed me a better way. First, cut the cabbage into quarter lengthwise, going from the stem to the opposite end. Next, use the knife to completely slice away the white core, leaving only the leaves. You now have four, dense stacks of cabbage leaves. Separate the leaves into smaller stacks. Now, working with one stack at a time, you can slice the leaves lengthwise into thin strips. There you are! Sliced cabbage. \n\nRegarding the pork, the two keywords to remember are “thick” and “quick.” Many cuts of pork have a very fine line between being undercooked and overcooked. Cutting the medallions to a thickness of 2 to 2.5 cm prevents the pork from quickly drying out when it hits the surface of the hot skillet. When you do place the medallions on the skillet, make sure it is indeed very hot. There will be sizzling and butter splattering, but that’s the way things go. Assuming you’ve cut the medallions to an appropriate thickness, the cooking time should be very quick. This is not an opportunity to multitask. Keep your attention on the medallions and sear them for about one and a half minutes per side. A nice crust will form and they’ll be all set to be reheated once the pan sauce is done.\n\nThe pan sauce consists of the drippings from the seared pork, a bit of lager, some chopped pear, butter, and dried rosemary. The end result is a sauce that lets each individual component shine. It’s sweet. It’s buttery. It’s slightly bitter. And it’s rosemary...y...ish. You’ll love it.\n\nWhen all is said and done, this dish is fun. The color contrasts are wild. That cabbage makes your eyes pop, especially with the white Gorgonzola crumbles on top. The ingredients are well-suited for winter. And since there are still 18 more days of winter, why not make another winter dish?","quote":"The last 18 days of winter deserve some attention.","description":"With the green of parsley, the white of Gorgonzola, the purple of braised cabbage, and the brown of seared pork medallions, this is the perfect opportunity to compose a bold art piece on your finest white plate. Winter is still here, so enjoy some quality winter food.","keywords":"Braised cabbage, pork tenderloin, gorgonzola, winter food, pan sauce, lager","prep_time":15,"cook_time":55,"category":"Dinner","cook_method":"Braise, sear, saute","cuisine":"American","__v":0}
{"_id":"6046f08c3f95c60008979a9b","_type": "recipe", "ingredients":["*Tian","1 garlic clove","1 eggplant","1 large onion","3 large tomatoes","1 tsp salt","45 mL (3 Tbsp) olive oil","1 tsp dried thyme","1 tsp dried oregano","1/2 cup loosely packed parsley leaves, chopped","*Crepes","2 eggs","120 mL (1/2 cup) water","120 mL (1/2 cup) milk","30 mL (2 Tbsp) olive oil + more for cooking","1/4 tsp salt","1 tsp dijon mustard","120 g (1 cup) flour","400 g (14 oz) cottage cheese","Fresh ground black pepper to taste"],"steps":["*Tian","Preheat oven to 190° C (375° F). Grab a 22x33 cm (9x13 in) casserole pan or a 30 cm (12 in) diameter baking dish. I usually use my 12 in cast iron skillet. Peel the garlic clove and use some elbow grease to rub the garlic on the bottom and sides of the pan. ","Slice the eggplant, onion, and tomatoes into 6 mm (1/4 in) rounds. Arrange the slices how you want in your selected pan. You can use the photo on this page as a reference if using a round pan. Otherwise, just layer the slices so that they look beautiful.","Drizzle the olive oil evenly over the vegetable slices. Sprinkle the thyme, oregano, and salt evenly over everything. Cover tightly with foil and place in the oven for 50 minutes. Begin to prepare the crepes.","Remove the foil and continue cooking for another 20 minutes. Remove from oven, sprinkle parsley on top, and serve immediately. ","*Crepes","In a small bowl, whisk together the flour and salt. In a medium bowl or large liquid measuring cup, whisk together the eggs, water, milk, olive oil, and mustard. The liquid ingredients can also be combined using an immersion blender.","Add the dry ingredients to the wet ingredients and use your whisk, fork, or immersion blender to stir until evenly combined.","Heat a medium-size nonstick skillet over medium-high heat. When hot, add about 5 mL (1 tsp) olive oil. Pour in about 80 mL (1/3 cup) of the crepe batter and quickly rotate the pan to swirl the batter evenly across the pan bottom. ","Let the crepe cook 30-60 seconds and then use a spatula to flip the crepe. Cook for another 30-60 seconds until the crepe is cooked through and both sides are light brown. Repeat with remaining crepe batter.","Fill each crepe with a generous amount of cottage cheese. Sprinkle desired amount of black pepper over cottage cheese and roll the crepe up. Serve alongside the tian."],"images":["https://i.ibb.co/wdhcv5c/tian2.jpg","https://i.ibb.co/tZWV6qn/tian.jpg","https://i.ibb.co/x84FgN3/tian3.jpg"],"is_published":true,"publish_date":"2021-03-18T04:12:50.395Z","created":"2021-03-17T23:17:54.978Z","ratings":[5],"newsletter":false,"title":"Provençal Tian and Cottage Cheese Filled Crepes","size":"4","intro":"Check out this fun rabbit hole. I was doing a bit of googling about the word tian, and discovered on the great Wikipedia that Tian is a popular surname in mainland China. Reading about Tian as a surname, I found out that there is a South African rugby player named Tian Meyer. He’s only six months older than me. Who knew. He plays for a team called the Cheetahs. They wear black shorts and orange socks as part of their uniforms. And with that, I put an abrupt end to my rabbit hole journey. \n\nFor today’s context, the word tian refers to the layered vegetable dish you are about to make. This can be a little confusing, because tian also refers to a literal, physical dishware made out of clay. What do folks in southern France traditionally cook in a clay tian? Well, tian, of course. See the confusion? If you own a clay dish in a truncated cone shape, the typical tian shape, feel free to cook today’s recipe in it. If you don’t (I don’t), a glass, ceramic, metal, or cast iron dish, combined with a watchful eye over the cooking time in the oven, will do just fine.\n\nSo, a tian in the French region of Provence is a baked dish usually consisting of layered vegetables. Usually no liquid, other than what is naturally found in the vegetables or other ingredients, is added to the dish. A few good slugs of oil, some seasonings, and the heat of the oven takes care of the rest. I know, I know, tis not quite the best season for many of the ingredients in this recipe, but my local winter was interrupted this past weekend with near summer temperatures, and I think I’m seasonally confused.\n\nYou don’t need a mandolin, but try extra hard to cut those vegetable slices super thin. A little focus and bit of patience can go a long way when slicing vegetables. Try it. When you arrange the vegetables in layers, have fun. If you search “tian provençal,” you’ll see many beautiful, circular arrangements. Another option is to layer the vegetables in rows in a rectangular dish. It doesn’t matter so much the shape or arrangement as long as the vegetables are layered and cut sufficiently thin. \n\nThe last tip regarding the tian is to keep it in the oven long enough. Long enough might be longer than you predict. It’s worth the wait. The tian is ready when the vegetables are melt-in-your-mouth tender. If you try to rush things, you’ll end up with an undercooked tian, and no one wants that.\n\nAlongside the tian, you will be making cottage cheese filled crepes. Eating the tian alone isn’t a bad thing to do per se, but bringing in the crepe component rounds out today’s dish into a complete meal.\n\nMy suggestion is to initially put all your energy and attention into getting the tian into the oven. Once in, you’ll have at least an hour before chow time. This gives you ample time to make a nice stack of crepes, fill and roll them, and probably even be able to wash a few dishes before your oven timer dings.","quote":"A layered sea of vegetables.","description":"Spending at least an hour in the oven, the flavors of the layered tomato, onion, and eggplant will gracefully blend with the added seasonings and olive oil to create a melt-in-your-mouth masterpiece. Bring the meal to completion with a delectable serving of cottage cheese filled crepes.","keywords":"Provencal, crepes, tian, vegetables","prep_time":20,"cook_time":80,"category":"Dinner","cook_method":"Bake, fry","cuisine":"French, Provencal","__v":0}
{"_id":"6075ae8a2fa64f0008717d54","_type": "recipe", "ingredients":["1.1 kg (2.5 lbs) Yukon Gold potatoes","35 g (1/4 cup) golden raisins","450 g (1 lb) ground beef","1 large onion, diced","1 medium jalapeño, ribs and seeds removed, minced","60 g (1/2 cup) chopped green olives","2 garlic cloves, pressed or minced","1 tsp oregano","1 tsp paprika","2 eggs, hardboiled and chopped","2 Tbsp minced cilantro","1 Tbsp + 2.5 tsp salt","1/2 tsp black pepper","small bowl of flour","2 eggs in a bowl, lightly beaten","oil for frying","1/4 of a red cabbage, sliced thin","cilantro for serving"],"steps":["*Potatoes","Place the potatoes in a stockpot and cover them 5 cm (2 in) water. Add 1 Tbsp of salt. Set over high heat and bring to a boil. When boiling, cover, and reduce heat to a simmer. Let simmer for about 25 minutes, or until the potatoes are tender. You can check this with a paring knife.","Drain the potatoes. As soon as you can handle the potatoes, use a sharp paring knife to peel them. Then use a potato ricer or a potato masher to mash them. Stir in 1 tsp of salt and allow the potato mash to cool while you continue preparing the filling.","*Filling","Place the raisins in a small bowl and cover with hot water. Allow them to soak for about 20 minutes. Drain and set aside.","Place a large skillet over medium-high heat. When hot, add the ground beef. Use a spatula to break up the beef. Stir infrequently to allow the beef to brown. Cook for about 7 minutes.","Add the onion and jalapeño and cook for about 6 minutes, stirring occasionally. ","Stir in the olives, garlic, oregano, and paprika and cook for an additional 2 minutes. Remove from heat.","Mix in the eggs, 2 Tbsp minced cilantro, 1.5 tsp salt, and 1/2 tsp black pepper. The filling is now ready.","*Assembly","Take about 100 g (1/2 cup) of mashed potato and flatten it into an oblong disk in your hand. Then take 2-3 Tbsp of the filling and press it into the center of the disk. Using both hands, fold the potato disk up and around the filling and seal the potato so that the filling is entirely contained within. The final product should look like a peeled potato.","One at a time, put each potato unit in the bowl of egg, then transferring to and coating evenly in the bowl of flour. Add an inch or two of oil to a large saucepan and place over medium-high heat.","When the oil is hot, about 175° C (350° F), carefully place four of the potatoes into the pan. Fry for 5-6 minutes, turning occasionally to ensure even browning. Remove from oil and transfer to a paper towel lined plate. Repeat with the remaining four potatoes. ","To serve, top with sliced red cabbage and cilantro. Serve alongside a salsa or dressing of your choice."],"images":["https://i.ibb.co/HdWsCt4/papa-rellena-4.jpg","https://i.ibb.co/DYGDBpL/papa-rellena-1.jpg","https://i.ibb.co/5hdnWtW/papa-rellena-2.jpg","https://i.ibb.co/mc1HD8j/papa-rellena-3.jpg","https://i.ibb.co/kXHwLL0/papa-rellena-5.jpg"],"is_published":true,"publish_date":"2021-05-11T19:38:32.496Z","created":"2021-05-11T22:16:58.449Z","ratings":[5],"newsletter":false,"title":"Papa Rellena","size":"8","intro":"There is a slight, slight chance that someone reading this will have noticed I’ve been quite absent for several weeks. To that reader, I will provide an explanation. I got a job! A few years ago I started an immersive journey into the world of web development and computer programming. Peel the Garlic, in fact, was born as a hobby coding project. The hours of head-scratching and keyboard mashing seem to have paid off and I’m employed full-time in my first software engineering position. Exciting, I know! The downside, obviously, is that my time is now distributed quite differently than before. I’m still hanging out in the kitchen on a daily basis, I just haven’t been able to maintain a weekly recipe release since starting a new job. I’m here to apologize and clarify my plan going forward.\n\nI cannot guarantee weekly published recipes, but I can guarantee that Peel the Garlic will continue. For those of you who live for consistency, I’m sorry. New recipes will be published (like this one for example), but on a relatively random and sporadic timeline. If that doesn’t put some excitement and spontaneity in your life, I don’t know what will. So with that, on to today’s recipe!\n\nClose your eyes for one moment and visualize a potato. Now open them again so you can keep reading. DO you know where the potato originally came from? It’s not Idaho, yo. It comes from a magical place high in the mountains with an ancient underwater temple: Lake Titicaca. At an elevation of over 12,000 ft, Lake Titicaca straddles the border of Peru and Bolivia in the Andes mountains. The rumor in the history world is that this region is the birthplace of the potato. Today, Peru is home to over 3,000 (or 4,000, according to some) potato varieties. Pause now and do a Google Image search for Peruvian potatoes and you’ll see some colorful, oddly-shaped spuds.\n\nAs a result of hosting varieties upon varieties of these tubers, Peru is also home to some really great potato dishes. One of these, papa rellena, is mega-fun because the final product ends up looking again like a whole potato. But cut inside to that “potato”, and, surprise!\n\nThe idea behind papa rellena is simple: envelope a savory sauteed mixture with mashed potatoes, and deep fry the entire unit. You’ll be using basic Yukon Gold potatoes in this recipe, so no need to journey to the Andes for the fancy stuff. The potatoes will be boiled skin-on and peeled post-boil when cool enough to handle.\n\nThis recipe goes with a classic papa rellena filling, including ground beef, hard boiled eggs, raisins, olives, and a few other flavorful ingredients. You could definitely play around with what goes into papa rellena, so feel free to get experimental after trying today’s recipe.\n\nThe most difficult step in the entire process, in my opinion, is sealing the mashed potato around the filling. The potato might start to stick to your hands, the filling might pop out of the potato, and the doorbell might ring. So I’ll tell you what works best for me. Before plopping a potato glob into your hands, coat them in oil. I’ve heard other people like to dust cornstarch on their hands instead, and maybe that works as well. Either method should work. Once you’ve flattened out the potato mash into a disk, add as much filling as you dare. For me, this amount is usually between 2-3 tablespoons. Now here comes the important part. Get both of your hands, side by side, under that potato disk. Almost as if you had just landed in your hands. In one clamshell motion, keeping the pinky-sides of your hands together, fold the disk together, wrapping the potato completely around the filling. You did it! Now make it look like a rugby ball and move onto the next one.\n\nI like to wait until all the rugby balls are complete before beginning the egg&#x2F;flour drenching process. At this point, as long as your oil is hot enough, you’re ready to fry those things. Be sure to monitor the cooking. One, it’s hot oil, and two, you want even browning, not even burning.\n\nOnce they’re all done frying, it’s time to serve. Top with the cabbage and cilantro. If you wish, you can also accompany the dish with a salsa or other sauce of your choosing. Enjoy!","quote":"Memorize all the Peruvian potato varieties and you win.","description":"Here we have another delectable potato-dish from Peru. Shaped like a potato, Papa Rellena is deep-fried mashed potatoes stuffed with an assortment of savory goodies including ground beef, raisins, olives, hard boiled eggs, and more. Serve it with red cabbage, cilantro, and a salsa of your choice.","keywords":"Peruvian, papa rellena, potatoes","prep_time":45,"cook_time":65,"category":"Dinner","cook_method":"Boil, fry","cuisine":"Peruvian","__v":0}
{"_id":"60fb0924eb984d0008961c3c","_type": "recipe", "ingredients":["*Marinade","1 kg (2 lbs) chicken thighs","60 mL (1/4 cup) vegetable oil","2 garlic cloves, minced or pressed","2 tsp paprika","1 tsp salt","15 mL (1 Tbsp) red wine vinegar","*Main","500 g (1 lb) okra, cut into 1 cm (1/2 in) slices","1 large yellow onion, diced","1/2 tsp salt","3 garlic cloves, minced","1 large jalapeño, seeds and ribs removed, minced","720 mL (3 cups) chicken broth"],"steps":["*Marinade","Combine oil, garlic, paprika, salt, and red wine vinegar in a small bowl and whisk together until blended.","Place the chicken thighs in a sealable container or plastic bag. Add the marinade and stir or shake to coat all the pieces. Let the chicken marinate on the counter for about 30 minutes.","*Main","Heat a large skillet on medium-high heat. Add one tablespoon oil. When hot, add the okra pieces. Cook for 20 minutes, stirring often. While cooking, the okra will release its slimy \"drool.\" The longer you cook, the more drool will be released. Remove from heat.","Place a large skill over high heat. Add one tablespoon oil. When very hot, add the chicken thighs. Cook for 2-3 minutes until browned, flip, and cook the other side for another 2-3 minutes until browned. You may have to do this in batches, depending on the size of your skillet. Do not overcrowd. Remove from heat.","Place a medium to large stockpot over medium-high heat. Add one tablespoon oil. When hot, add the onions and 1/2 tsp salt. Cook for six minutes.","Add the garlic, jalapeño, chicken thighs, and chicken broth. Bring to a boil, reduce heat, and simmer for 10 minutes. Add the okra pieces and simmer for another 5 minutes.","Remove from heat and serve immediately."],"images":["https://i.ibb.co/N6T1J4j/frango-com-quiabo1.jpg","https://i.ibb.co/vYTk2Hq/frango-com-quiabo2.jpg","https://i.ibb.co/GHYL2Hn/frango-com-quiabo3.jpg"],"is_published":true,"publish_date":"2021-07-23T21:50:15.561Z","created":"2021-07-23T21:38:38.143Z","ratings":[5,5],"newsletter":false,"title":"Frango com Quiabo","size":"4","intro":"If you have a hunch that this is the first time okra is featured on Peel the Garlic, you are absolutely right. So let’s join together in welcoming okra to the family! And not to one up okra’s big achievement of the day, but this is also the first Brazilian recipe to land on the website. Unfortunately I have not yet had the chance to visit the largest country of South America, but I was recently having a conversation with a couple of my Brazilian friends who inspired me to have a go at Brazilian cooking. What you see here is the result of that cooking experiment.\n\nI’m first going to talk a bit about our new okra friend, and then I’ll go into more detail about the dish you will be cooking today.\n\nI honestly don’t know if I had ever consumed okra in any form other than deep-fried before working on this recipe. Growing up in the South of the United States, seeing crispy, deep-fried okra as a side dish at weekend cookouts was fairly common. And it’s good like that. Try it if you haven’t.\n\nThe okra plant is a proud member of the hibiscus family. As a sidenote, if you’ve never tried any sort of hibiscus flower drink, you should! Hot, cold, it’s all good. Anyway, the okra plant. The part of the plant you can buy at the supermarket is the okra seed pod, picked at a very young age. Apparently some countries refer to these pods as ladies’ fingers, but that’s funky. So I’ll refer to them as okra. Now, what do you find when you cut into okra? Seeds and slime, man. The slime may be one of the reasons okra isn’t a crazy popular ingredient like, let’s say, cucumber.\n\nTechnically, the slime is called “plant mucilage.” Mucilage is actually found in most plants. Okra just has a lot of it. What’s it for, you ask? It helps the plant store water. Now ask me no more, that’s all I know. Some dishes, like gumbo,  actually take advantage of the okra slime and use it as a thickener. Other dishes, like the one today, try to minimize the amount of slime left when the dish is served. To get the okra pieces to release their slime, you will simply saute the pieces in a skillet for about 20 minutes. As they cook, the slime will leave the okra and mostly evaporate one the skillet surface. \n\nI’m not going to act like I know a lot about the origins of today’s recipe, frango com quiabo, but I will tell you what I’ve learned in my research. The dish is from a southeastern state in Brazil called Minas Gerais. I’ve been told by several friends that Minas Gerais is known for its culinary scene. So would I like to visit someday? I would, and you can’t change my mind. \n\nThe idea behind Frango com Quiabo, or “chicken with okra” in English, is simple. Cook the okra and coax them to let go of their beloved slime. Brown the marinated chicken thighs. Concoct a rich broth from onion, garlic, jalapeño, and chicken broth. Then, combine it all together, let it simmer, and enjoy. The ingredients list is relatively short, and the steps aren’t all too complicated. You are ready for some Brazilian cooking.","quote":"Okra doesn’t always have to be deep-fried.","description":"Today you’ll get a taste from the Brazilian state Minas Gerais. Browned chicken thighs and sauteed pieces of okra come together in a rich broth to offer everyone at the table a comfort-style, earthy-flavored experience.","keywords":"stew, chicken, brazilian, okra","prep_time":30,"cook_time":50,"category":"dinner","cook_method":"saute, fry, sear, simmer","cuisine":"Brazilian","__v":0}